{
    "locations": [
        {
            "id": 0,
            "name": "Чернігів",
            "region": "Чернігівська область",
            "year": 907,
            "population": 280000.0,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/chernihiv_2.jpg", "name": "Гармата Валу"}, 
                {"file": "../assets/chernihiv_1.jpg", "name": "Свято-Троїцький собор"},
                {"file": "../assets/chernihiv_3.jpg", "name": "Чернігівський колегіум"},
                {"file": "../assets/chernihiv_4.jpg", "name": "П'ятницька церква"},
                {"file": "../assets/chernihiv_6.jpg", "name": "Будівля Чернігівського обласного філармонійного центру"},
                {"file": "../assets/chernihiv_7.jpg", "name": "Адміністративна будівля в центрі міста"},
                {"file": "../assets/chernihiv_8.jpg", "name": "Чернігівський Дитинець"},
                {"file": "../assets/chernihiv_10.jpg", "name": "Будівля залізничного вокзалу"}
            ],
            "short_description": "Черні́гів — місто в Україні, адміністративний центр Чернігівської міської громади, обласний та районний центр Чернігівської області, Місто-герой. Найпівнічніший обласний центр України.\n\nНалежить до найдавніших міст України, заснований у кінці VII століття (хоча перша згадка датується 907 роком) при впаданні річки Стрижень у Десну. Чернігів у часи Середньовіччя — одне з головних міст Київської Русі та, за оцінками істориків, одне з найбільших міст тогочасної Європи, столиця Чернігівського князівства, до володінь якого належали, зокрема Кубань, Керченський півострів, Муром, Рязань і частина нинішнього Підмосков'я. За козацької держави Богдана Хмельницького стало головним містом Чернігівського полку. Завдяки діяльності чернігівських архієпископів Лазара Барановича й Іоанна Максимовича та підтримці гетьмана Івана Мазепи Чернігів перетворився на один із значних осередків освіти й культури в Україні. У місті, зокрема, діяв Чернігівський колегіум — перший вищий навчальний заклад на території Лівобережної України.\n\nЧернігів славиться своїми пам'ятками часів Русі та Гетьманщини. Історичний центр Чернігова є кандидатом на внесення до переліку об'єктів Світової спадщини ЮНЕСКО.",
            "history_description": "За переказами і легендами, Чернігів отримав назву на честь першого місцевого князя — Чорного. На сьогодні відомо багато різних легенд і переказів пов'язаних із назвою міста. За одними з них, назва міста пов'язується із ім'ям дочки цього ж князя «Чорного», яка викинулася з вікна княжого терему, щоб уникнути наруги з боку ворогів, які стояли облогою навколо міста. Інші легенди кажуть, що Чернігів завдячує своєю назвою темним, дрімучим, «чорним», лісам, які з усіх боків оточували місто. Також існує версія про велику кількість «серн», тобто сарн, які населяли околиці цієї місцевості. І ніби, з часом, назва міста змінилася з Сернігів на Чернігів.\n\nНа території сучасного Чернігова виявлені сліди заселення з неоліту і бронзової доби. Наприкінці VII століття в середній течії річки Десна тут виникло укріплене городище.\n\nВперше Чернігів згадується в літописі під 907 роком в «трактаті князя Олега з греками». У ранньому середньовіччі місто було укріпленим городищем, а з IX століття увійшло до складу Київської Русі.\n\nУ XI—XIII століттях Чернігів був центром Сіверщини і Чернігівського удільного князівства. Першим у ньому господарював Мстислав Володимирович, брат Ярослава Мудрого. Після його смерті Чернігів опанував його брат Ярослав, а згодом племінник Святослав Ярославич, родоначальник чернігівської княжої династії Святославичів.\n\nУ княжу добу Чернігів знаходився на плато між річкою Десною та її притокою Стрижнем. У центрі міста був розташований замок із княжим двором — дитинець, до якого прилягав окольний град — передгороддя і район Третяк, де мешкали купці й ремісники. Кожна частина Чернігова мала свої оборонні вали. Над Десною лежав торговий Поділ. У середині XII століття територія міста без Подолу становила близько 120 га. Управління чернігівської княжої династії створювало належні умови для розвитку культури міста і залежних володінь. Це відбилося насамперед на архітектурі й образотворчому мистецтві. Чернігівські монументальні будови XI—XII століть, особливо церкви і собори, були видатними пам'ятками тієї доби. У першій половині XI століття в центрі дитинця постав Спасо-Преображенський собор. Протягом XII століття — початку XIII століття побудовано собор Бориса й Гліба (Чернігів), Іллінську, Благовіщенську, Михайлівську церкви, Успенський собор Єлецького монастиря, П'ятницьку церкву. Чернігівці княжої доби залишили свій слід також у літературі Русі. Зокрема, чернігівський ігумен Данило є автором опису мандрівки до Святої Землі кінця XI — поч. XII століття. Уривки Чернігівського літопису, що не зберігся, знаходимо у пізніших літописних збірниках.\n\n1239 року місто було зруйноване монголо-татарами й занепало. Монгольська навала перервала зростання Чернігова на тривалий час. Місто опинилося в складі держави Золотої орди. Центром Сіверської землі став Брянськ.\n\nУ 1353 році Чернігів увійшов до складу Великого князівства Литовського і Руського, а у 1503 році був завойований Московією. Завойовники звели на узбіччях дитинця фортецю і розбудували передгороддя.\n\nЧернігів не раз зазнавав руйнації від нападів татар. Особливо місто постраждало під час їхніх походів у 1482 і 1497 роках.\n\nУ 1618 році за Деулінським перемир'ям Чернігів перейшов від Московії до Речі Посполитої. У 1623 році місто отримало магдебурзьке право, магістрат і герб, а з 1635 року стало центром Чернігівського воєводства.\n\nСоціокультурний розвиток Чернігова у XIV — XVI століттях гальмувався через постійні війни Великого князівства Литовського і Руського та Московії. Ці держави боролися за домінування у Східній Європі, перманентно спустошуючи Чернігівщину і Сіверщину. Перші паростки культурного відродження з'явилися із настанням XVII століття. Зокрема, архімандрит Єлецького монастиря Кирило Ставровецький збудував у 1646 році в Чернігові першу друкарню.\n\nЧернігів став одним із перших міст, яке отримало повідомлення про повстання Богдана Хмельницького.Доведені до відчаю магнатсько-шляхетською тиранією селяни й міщани часто створювали свої окремі загони на місцях і «пановъ своїхъ… ляховъ… ксєндзовъ позабїяли (костелы) попустошили». Стихійний рух поступово переростав у організоване повстання. Слід зазначити, що в місті перебувала шляхта майже зі всього Лівобережжя. Великий магнат Ярема Вишневецький, тікаючи від повстанців, зупинявся в Чернігові й схиляв шляхту на свій бік, пропонуючи йти разом із ним за Дніпро, на Правобережжя. Однак чернігівська шляхта, не усвідомлюючи ще всієї небезпеки й покладаючись на захист навколишніх лісів, залишилась, сподіваючись відсидітись у міцному замку. Та наприкінці травня козаки підступили до міста, а 13 червня вже стало відомо про облогу Чернігова повстанцями. За свідченням джерел, облога Чернігова тривала три тижні. І замок не витримав її. Згідно з відомостями анонімного кореспондента із Варшави від 2 серпня, сусідні з Черніговом міста також здавалися козакам, «выдавая ѣм на муки шляхту католиковъ»; в одному з них «больше чем 800 шляхты вырублено». Однак під час Визвольної війни Чернігів іще довго продовжував бути ареною для боротьби з лядським військом, магнатами й шляхтою. Становище склалося таким чином, що після Зборівського договору 1649 р. Чернігівщина знову повернулася під контроль польської знаті. На початку 1651 р. боротьба відновилася. Тут було зосереджено 20 000 осіб Чернігівського полку Мартина Небаби. Після звільнення Чернігова козаки намагалися взяти Гомель, але були розбиті у бою під Ріпками. У результаті численних боїв військові сили України значно вичерпалися. Богдан Хмельницький змушений був піти на підписання миру. 18 вересня 1651 р. підписано Білоцерківський договір. Після цього коронне військо Речі Посполитої знову окупувало Чернігівщину.\n\nПіднесення життя Чернігова почалося, коли він увійшов до складу Козацько-Гетьманської Держави і став центром Чернігівського полку. На цей час припадає розквіт культурного життя Чернігова, він став одним із найважливіших культурних центрів України.\n\nКультурне відродження Чернігова пов'язане з діяльністю архієпископа Лазаря Барановича, який переніс до Чернігова друкарню, закладену ним у Новгороді-Сіверському в 1675 році. Навколо Барановича утворився літературно-мистецький гурток, до якого належали: архімандрит Єлецького монастиря Іоанікій Галятовський, архідиякон Чернігівської єпархії Антоній Радивиловський, ієромонах Чернігівського Троїцько-Іллінського монастиря Л. Тоболинський, поет Іван Величковський, майбутній архієпископ чернігівський Іван Максимович; гравери: Іван Інокентій Щирський, Леонтій Тарасевич, Н. Зубрицький; архітектори Адам Зерніков, Іоганн-Баптист Зауер (Іван Баптист) та інші.\n\nЗ ініціативи Л. Барановича й коштом гетьманського уряду й чернігівської козацької старшини, відновлено і перебудовано в бароковому стилі чернігівські пам'ятки, зокрема Троїцький кафедральний собор (16 ст.). Особливе значення мало створення Чернігівського Колегіуму (1700), який став одним із головних осередків освіти і науки Гетьманщини. У першій половині 18 ст. в Чернігові з'являються нові монументальні споруди: релігійні (барокова Катерининська церква, 1715) й світські (будинок полкової канцелярії, відомий під назвою «Мазепиного будинку» або будинок Якова Лизогуба) будови. У 1783 році збудовано один із перших мостів Чернігова — Красний міст через річку Стрижень.\n\nУ 1782 Чернігів став центром Чернігівського намісництва Російської імперії, а 1797 — Малоросійської губернії, з 1808 - Чернігівської губернії. Тоді місто нараховувало близько 4000 мешканців, у 1844 році їх кількість збільшилася до 12 000, 1897 — до 27 000, 1913 — до 35 000. Економічний характер тогочасного Чернігова був адміністративно-торгівельно-ремісничий: дрібна місцева харчова промисловість, цегельні, свічковий і миловарний завод тощо. Чернігів поширювався в західному і північно-західному напрямі.\n\nХоча Чернігів не був великим містом, він і далі, у другій половині XVIII століття зберігає значення великого культурного центру. На культурному ґрунті Чернігова наприкінці XVIII — на початку XIX століття згуртувалося коло українських «дворянських патріотів», які боронили автономні права України й вимагали визнання дворянських прав для козацького стану: А. Полетика (чернігівський губ. маршал), аматор-історик А. Чепа (товариш малоросійського поштмейстера), Р. Маркевич і Т. Калинський. Вони досліджували історію України, збирали історичні документи, літописи й на підставі їх складали записки про історію й права українського шляхетства, які поширювали на всій території Лівобережної України.\n\nТа найбільше розгорталося культурне життя Чернігова від другої половини XIX століття. На відміну від попередньої епохи з її перевагою локальних і станових дворянських інтересів і прагнень, воно чимраз далі набирало загальнонаціонального українського характеру. У Чернігові працювали історики: О. Лазаревський, граф. Г. Милорадович, О. Ханенко, брати Микола і Митрофан Константиновичі, А. Верзилов, П. Дорошенко та ін.; етнографи О. Маркевич, О. Шишацький-Ілліч, С. Ніс, байкар Л. Глібов, статистики — О. Русов, В. Варзар, П. Червінський, В. Шликевич та ін. Дехто з них належав до Чернігівської Громади, однієї з найрадикальніших в Україні.\n\nБув Чернігів і видавничим центром. Ще з 1858 там почав виходити орган губернатора — тижневик «Черниговские Ведомости» (до 1917). У 1861—1863 pp. Л. Глібов видавав «Черниговскій Листокъ», єдину тоді на Чернігівщині Україні українську газету. Від 1861 до 1911 виходили також «Черниговские єпархиальные известия», а в 1868—1872 роках «Записки» Чернігівського Статистичного Комітету.\n\nЗа переписом населення 1897 року в Чернігові жило 11 000 євреїв (усе населення 27 000). Вони були зайняті переважно в промисловості і комерції, а також займалися садівництвом і вирощували тютюн.\n\nПід кінець XIX століття культурне життя Чернігова значно активізувалося. Головними його осередками були Чернігівське земство і його статистичний Комітет, Губерніальна Архівна Комісія (заснована 1896 з ініціативи О. Лазаревського й Г. Милорадовича), яка у своїх «Трудах» 1897—1915 рр. видала багато документів, Музей Тарновського, подарований його фундатором В. Тарновським (молодшим). У Чернігівському земстві навколо цих установ об'єднувалися місцеві науковці, педагоги, письменники, митці, діяльність яких нерідко виходить за межі Чернігівщини.\n\nНа межі XIX і XX століть жили у Чернігові письменники: М. Коцюбинський (похований у Чернігові), Б. Грінченко, В. Самійленко, М. Вороний, М. Чернявський, маляр І. Рашевський, історик В. Модзалевський та ін. Коло цих визначних діячів гуртувалася й виховувалася українська молодь, здебільшого вихованці Чернігівської гімназії й Духовної семінарії. У 1911 році відбувся в Чернігові XIV Археологічний З'їзд. 1916 засновано Педагогічний Інститут.\n\nПід час радянсько-української війни 1917 року в Чернігові створено загони Вільного Козацтва і влада перейшла в руки Центральної Ради. За української влади пожвавилось українське культурне життя (видавництво «Сіверянська думка», щоденник губернського земства «Чернігівщина», орган губернської Ради Селянських Депутатів «Народне Слово», українські школи тощо). Першого лютого 1918 року Чернігів захопило більшовицьке військо; 12 березня 1918 року він повернувся під владу уряду Української Народної Республіки, але знов був окупований більшовиками 12 січня 1919 року. Від 13 жовтня до 12 листопада 1919 року Чернігів був у руках денікінців. Наприкінці 1919 року в Чернігові було остаточно встановлено радянську владу. У 1925—1932 Чернігів був центром Чернігівської округи, а з 1932 року - обласним центром новоствореної Чернігівської області. За переписом 1926 року, Чернігів нараховував 35 200 мешканців, у тому числі 57 % українців, 20 % росіян і 10 % євреїв. За доби п'ятирічок завдяки зростанню промисловості населення Чернігова збільшилося до 69 000. Чернігів зберігає своє значення культурного центру в 1920-х і на початку 1930-х років. Тут діяли: Історичний музей (колишній музей Тарновського, значно збагачений), архів Наукового Товариства Інститут Народної Освіти (з 1920). Діяльність цих установ була щільно пов'язана з ВУАН, зокрема з її історичною секцією та Археологічним Комітетом, з центральними історичними архівами у Києві й Харкові, Інститутом Української Культури ім. Д. Багалія (Харків) та ін. 1926 року відкрито театр ім. Шевченка. З Черніговом пов'язані імена письменників: П. Тичини, І. Кочерги, В. Еллана-Блакитного, А. Заливчого, І. Коваленка; істориків П. Савицького, Є. Онацького, В. Дубровського, В. Шугаєвського, мистецтвознавця О. Гукала тощо. Місто постраждало під час проведеного радянською владою Голодомору 1932—1933 років, 30 березня 1933 року на «чорну дошку» занесений Чернігівський ліспромгосп, померло щонайменше 3602 жителі Чернігова.\n\nУ роки Другої світової війни місто опинилося під німецькою окупацією. Всього за час окупації були вбиті 52453 жителів міста і полонених солдат. 695 осіб були вивезені на примусові роботи в Німеччину. У січні 1942 р. в місті почала діяти група підпільників, яку очолив А. Д. Михайленко, по професії радіотехнік. На заводі «Октябрьский молот» в перші місяці 1942 р. також була організована підпільна група, на чолі з Н. С. Шарим. Робітники займались саботажем виробництва, за що Шарого заарештували і після допитів відправили у табір Дахау. 21 вересня 1943 року Чернігів зайняли радянські війська.\n\nПісля Другої світової війни Чернігів відбудовано за генеральним планом (1945, 1958 і 1968) і реконструйовано. Центр міста зовсім перебудовано у 1950—1955 роках (архітектори П. Буклавський, І. Ягодовський). Населення Чернігова зростало швидко: 1959 — 89 585 осіб (у тому числі українці становили 69 %, росіяни — 20 %, євреї — 8 %, поляки — 1 %), 1970 — 158 873 осіб, 1980 — 245 000 осіб. Промисловість Чернігова досягла довоєнного рівня на початку 1950-х років.\n\nУ 1990 році в Чернігові відбулася Ковбасна революція — стихійний виступ жителів міста проти діючої влади у різдвяні дні 1990 року. Події набули широкого резонансу, породили низку аналогічних акцій в інших містах Радянського Союзу. Результатом подій стала зміна обласного і міського партійного керівництва, посилення авторитету опозиційних політичних сил. Ця подія стала однією з передумов незалежності України.\n\n21 листопада 2013 р. в Києві на Майдані Незалежності розпочався мітинг на знак протесту проти рішення уряду України заморозити переговори з Євросоюзом щодо угоди про асоціацію. Чернігів приєднався до Євромайдану вже 22 листопада. О 16-й годині під будинком Чернігівської ОДА зібралось близько сотні громадян. Але вже за годину усі розійшлися — завадив дощ. 7 грудня 2014 р. з 13-00 до 15-00 був мітинг, на якому було до 1000 осіб.  20 лютого 2014 р. на молебні про жертв виступів у Києві (Небесна сотня) зібралась повна площа людей. Через декілька днів буде скинуто пам'ятник Леніну в центрі міста",
            "climate_description": "Чернігів знаходиться в західній частині Чернігівської області. Місто розташоване у Придніпровській низовині, на правому березі річки Десни. Вздовж міста протікає річка Стрижень. Чернігів знаходиться в зоні, яка характеризується континентальним кліматом. Найтепліший місяць — липень із середньою температурою 18,9 °C. Найхолодніший місяць — січень, з середньою температурою −5,6 °С. Оскільки Чернігів розташований неподалік від болотянї місцевості на півночі Чернігівщини, то у травні-червні кожного року спостерігається велика кількість комарів, особливо у прибережних зонах.",
            "districts_description": "Чернігів поділяється на 2 райони: Деснянський та Новозаводський. Райони ділять місто навпіл (межа проходить по проспекту Миру): Деснянський — східна частина, Новозаводський — західна частина міста. У місті налічується орієнтовно 550 проспектів, вулиць, бульварів, площ, провулків, скверів та узвозів. А саме: близько 400 вулиць, 100 провулків, 2 проспекти (Миру та Перемоги). Вулиці та провулки можна умовно поділити, бо місто поділене на 2 райони.",
            "economics_description": "Провідні галузі промисловості в Чернігові: хімічна, харчова, легка, будівельних матеріалів, деревообробна. Наявний також автозавод, який займається виготовленням автобусів та тролейбусів (ПрАТ «Чернігівський автозавод»)\n\nЗа даними опитування, проведеного Соціологічною групою «Рейтинг» у 2017 році, українці становили 91% населення міста, росіяни — 7%. Крім того, приблизно 1% від населення складають білоруси. Також станом на 2017 рік українською вдома розмовляли 18 % населення міста, російською — 53 %, українською та російською в рівній мірі — 28 %. Відповідно до результатів опитування, проведеного Міжнародним республіканським інститутом у квітні-травні 2023 року, українською вдома розмовляли 53 % населення міста, російською — 41 %.",
            "landmarks": [
                "Чернігівський Дитинець (Вал) та історичні гармати",
                "П'ятницька церква ПЦУ",
                "Катерининська церква ПЦУ",
                "Красний міст",
                "Красна площа",
                "Болдині гори",
                "Антонієві печери",
                "Стрілецька набережна річки Стрижень",
                "Регіональний ландшафтний парк 'Ялівщина'",
                "Набережна річки Стрижень на вулиці Георїв Чорнобиля"
            ]
        },
        {
            "id": 1,
            "name": "Київ",
            "region": "Київська область",
            "year": 482,
            "population": 2000000.0,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/kyiv_1.jpg", "name": ""}, 
                {"file": "../assets/kyiv_2.jpg", "name": ""},
                {"file": "../assets/kyiv_3.jpg", "name": ""},
                {"file": "../assets/kyiv_4.jpg", "name": ""},
                {"file": "../assets/kyiv_5.jpg", "name": ""},
                {"file": "../assets/kyiv_6.jpg", "name": ""},
                {"file": "../assets/kyiv_7.jpg", "name": ""},
                {"file": "../assets/kyiv_8.jpg", "name": ""}
            ],
            "short_description": "Одне з провідних міст Київської Русі",
            "history_description": "",
            "economics_description": "",
            "climate_and_geography_description": "",
            "landmarks": [
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                ""
            ]
        },
        {
            "id": 2,
            "name": "Харків",
            "region": "Харківська область",
            "year": 1654,
            "population": 1300000.0,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/kharkiv_1.jpg", "name": ""}, 
                {"file": "../assets/kharkiv_2.jpg", "name": ""},
                {"file": "../assets/kharkiv_3.jpg", "name": ""},
                {"file": "../assets/kharkiv_4.jpg", "name": ""},
                {"file": "../assets/kharkiv_5.jpg", "name": ""},
                {"file": "../assets/kharkiv_6.jpg", "name": ""},
                {"file": "../assets/kharkiv_7.jpg", "name": ""},
                {"file": "../assets/kharkiv_8.jpg", "name": ""}
            ],
            "short_description": "Ха́рків — місто на північному сході України, на Слобожанщині, науковий центр України, адміністративний центр Харківської області. Перша столиця Радянської України (1919-1934 рр.) Друге за кількістю мешканців місто України з населенням 1 421 125 осіб на 01.01.2022.",
            "history_description": "Харків був заснований у 1654 році як фортеця для стримування набігів кримських татар і ногайців. Місто стає полковим центром Харківського слобідського козацького полку. З 1765 року, у наслідку скасування козачого устрою Слобожанщини, Харків став губернським містом. На початку ХХ століття місто було великим промисловим, культурним, торговим та освітніми Слобідської України в Російській імперії. Після Лютневої революції 1917 року Харковом керували представники різних влад: Українська соціал-демократична робітнича партія, Партія українських соціалістів-революціонерів (есери), більшовики, ЗСПУ та інші. З грудня 1919 року до Харкова повернувся радянський уряд. Місто почало розвиватися у напрямку індустріалізації. Почали будуватися великі заводи, населення збільшувалось за рахунок міграції. Паралельно розвивається наука та культура. \n\n У Харкові вперше в Україні було розпочато радіомовлення. 16 листопада 1924 року о 19:00 в Харкові вийшла в ефір перша радіопередача. З гучномовців пролунало: «Алло, алло, алло! Говорить Харків, говорить Харків, говорить Харків!». На честь початку мовлення Українського радіо 1994 року 16 листопада в Україні проголошено Днем працівників радіо, телебачення та зв'язку В Харкові вперше в СРСР було розщеплене атомне ядро.\n\nПід час Другої світової війни німецька армія вступила до Харкова у жовтні 1941 року. За часи двохрічної окупації населення міста зменшилось більше ніж у 3 рази. За оцінками експертів Харків був одним із найбільш зруйнованих міст Другої світової війни в Європі.\n\nЗа часи радянської влади місто було великим промисловим, науковим, освітнім, транспортним центром України та СРСР. Харків в ті часи був відомий своїми заводами: ХТЗ (Харківський тракторний завод), Турбоатом та заводом ім. Малишева, будівлею Держпрому, найбільшою площею Європи (зараз площа Свободи), зоологічним парком, Харківським національним університетом та іншими. Значну роль в економіці СРСР Харків відіграв у авіаційному, тракторному та військовому машинобудуванні й електроніці. Через Харків проходили транспортні шляхи, які з'єднували центр імперії з півднем, захід з центром. У 1975 році у Харкові було відкрито першу лінію метрополітену.\n\nЗ початку Незалежності України Харків, як й вся країна, опинився у ситуації перебудови економіки. Багато підприємств було закрито або реконструйовано, через зв'язки з ринками країн СНД та залежність від російської нафти, мінералів і газу.\n\nЗ 2006 року місцева рада системно орієнтувала економіку, культуру та інші сфери життя містян на співробітництво з РФ. Протести Євромайдану взимку 2013—2014 років в Харкові були не численні. У березні та квітні 2014 року сили безпеки та контрдемонстранти завадили сепаратистським намірам створення в Харківській області автономії за сценарієм Донбасу. Опитування, які були проведені з вересня по грудень 2014 року, виявили в Харкові незначну кількість містян, які підтримували приєднання до Росії.\n\nЕкономіка Харкова після припинення співробітництва з РФ почала переорієнтовуватися на нові міжнародні ринки, військові підприємства мали збільшення оборонних контрактів, продовжував розвиватися експорт в секторі ІТ-послуг",
            "climate_description": "Харків розташований на схилах Середньоруської височини, в долинах річок Уди (ліва притока Сіверського Дінця), Лопань (ліва притока Уди) та Харків (ліва притока Лопань). Рельєф — яружно-балковий, з високими правими берегами річок. На території міста є штучні озера: водосховища та затоплені кар'єри. В заплавах річок трапляються стариці. Клімат Харкова — помірно-континентальний. Зима прохолодна та сніжна, з декількома відлигами; літо — спекотне, з короткочасними дощовими періодами; весна та осінь — короткі, з заморозками на ґрунті. Середня температура року становить +8,7 °C, середня річна кількість опадів — 520 мм. Харків розташовано в лісостеповій природній зоні. З рослинності домінують породи широколистяних лісів. Природно-заповідний фонд Харкова становлять 15 територій та об'єктів, серед яких 2 загальнодержавних (зоопарк і ботанічний сад ХНУ)",
            "districts_description": "Разом із прилеглими містами й районами утворює Харківську агломерацію з людністю понад 2 млн осіб. Територія Харківської міської територіальної громади поділяється на дев'ять адміністративно-територіальних одиниць — районів: Шевченківський, Новобаварський, Київський, Слобідський, Холодногірський, Салтівський, Індустріальний, Немишлянський і Основ'янський. Найбільшим за площею є Київський район, а найменшим — Немишлянський. З 2020 року місто входить до складу Харківського району",
            "economics_description": "Останній перепис населення 2001 року показав, що в місті мешкало 62,8 % українців. Українська мова є єдиною офіційною мовою міста. За даними опитування, проведеного Міжнародним республіканським інститутом у 2023 року більшість населення міста вдома спілкуються російською мовою.\n\nХарків має розвинуту мережу міського громадського транспорту: тролейбусні, трамвайні, автобусні маршрути та метрополітен (3 гілки з 30 станціями).\n\nЯк культурний та освітній центр Слобожанщини та України, Харків до 24.02.2022 мав 60 науково-дослідних інститутів, 45 вищих навчальних закладів, серед яких ХНУ імені В. Н. Каразіна, який входить до найкращих 500 ВНЗ світу та НТУ «ХПІ», який входить до найкращих 1000, 8 музеїв, міську картинну галерею, 7 державних театрів і кілька десятків недержавних, 80 бібліотек, спортивні об'єкти, виставкові зали та сучасні офісні простори",            
            "landmarks": [
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                ""]
        },
        {
            "id": 3,
            "name": "Житомир",
            "region": "Житомирська область",
            "year": 882,
            "population": 200000.0,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/zhytomyr_1.jpg", "name": ""}, 
                {"file": "../assets/zhytomyr_2.jpg", "name": ""},
                {"file": "../assets/zhytomyr_3.jpg", "name": ""},
                {"file": "../assets/zhytomyr_4.jpg", "name": ""},
                {"file": "../assets/zhytomyr_5.jpg", "name": ""},
                {"file": "../assets/zhytomyr_6.jpg", "name": ""},
                {"file": "../assets/zhytomyr_7.jpg", "name": ""},
                {"file": "../assets/zhytomyr_8.jpg", "name": ""}
            ],
            "short_description": "Місто, якого не існує",
            "history_description": "",
            "climate_description": "",
            "districts_description": "",
            "economics_description": "",
            "landmarks": [

                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                ""
            
            ]
        },
        {
            "id": 4,
            "name": "Львів",
            "region": "Львівська область",
            "year": 1256,
            "population": 717273.0,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/lviv_1.jpg", "name": ""}, 
                {"file": "../assets/lviv_2.jpg", "name": ""},
                {"file": "../assets/lviv_3.jpg", "name": ""},
                {"file": "../assets/lviv_4.jpg", "name": ""},
                {"file": "../assets/lviv_5.jpg", "name": ""},
                {"file": "../assets/lviv_6.jpg", "name": ""},
                {"file": "../assets/lviv_7.jpg", "name": ""},
                {"file": "../assets/lviv_8.jpg", "name": ""}
            ],
            "short_description": "Львів — місто в Україні, адміністративний центр області, агломерації, району, міської громади, національно-культурний та освітньо-науковий осередок країни, великий промисловий центр і транспортний вузол. Вважається столицею Галичини та центром Західної України. За кількістю населення — п'яте місто країни (717 273 станом на 01.01.2022).\n\nІсторичний центр Львова занесено до списку Світової спадщини ЮНЕСКО. У місті розташована найбільша кількість пам'яток архітектури в Україні. 2009 року Львову надано звання Культурної столиці України.",
            "history_description": "Археологічні розкопки свідчать, що територія сучасного міста була заселена ще у V столітті. Наприкінці X століття ці землі ввійшли до складу Русі, зокрема удільних Галицького, а з 1199 року — Галицько-Волинського князівств.\n\nЗасновником міста  вважають короля Данила, який назвав укріплене поселення на честь свого сина Лева, хоча жодне джерело не дає підстав для такого твердження. Місто розташувалося на межі належних Левові Перемишльського та Белзького князівств. Перша письмова згадка про Львів міститься у Галицько-Волинському літописі і датується 1256 роком, від якого і ведеться міське літочислення. Руський Львів складався з дитинця (Високого замку), королівської резиденції (Низького замку) та укріпленого подолу в районі сучасної площі Старий Ринок. 1272 року син короля Лев I Данилович, який сприяв розвитку міста (зокрема, визначив для новоприбулих три дільниці: на сході — руську, на півночі — для вірмен для татар, на півдні — для юдеїв) переніс столицю Галицько-Волинської держави з Холма до Львова. Тут також, ймовірно, перебував фактичний осідок митрополитів Галицьких, настоятелів окремої митрополії Константинопольського патріархату, що існувала з перервами від 1303 до 1401 року.\n\nПісля смерті галицько-волинського князя Юрія II Болеслава 1340 року волинські бояри проголосили правителем Дмитра-Любарта Гедиміновича. Того ж року король Польщі Казимир ІІІ напав на Львівську і Перемишльську землі; між ним і Любартом почалася «Війна за галицько-волинську спадщину». У цих умовах місцеві бояри під проводом Дмитра Дедька взяли владу до своїх рук, спершу визнаючи зверхність Королівства Польського, а з 1341 року — сюзеренітет Дмитра-Любарта Гедиміновича. 1349 року, після смерті Дмитра Дедька, Казимир ІІІ удруге захопив Львів і спробував приєднати (за іншими даними приєднав) Галичину до Польщі на автономних правах. 1356 року король Казимир ІІІ здійснив повторну локацію міста, перемістивши новий центр на південь від первісного, княжого граду. Поруч із руським подолом запрошені королем будівничі за німецькими зразками звели нове готичне місто-фортецю, поділене на квартали, з Ринком посередині. Більшість його населення становили німці; українці-русини жили переважно в передмістях. Існували самоврядні вірменська і єврейська громади. 1356 року король Казимир ІІІ надав Львову «маґдебурзьке» право самоврядування. З часів Казимира і до початку 15 ст. карбував монети Львівський монетний двір.\n\n1370 року, за договором між Казимиром ІІІ і угорським королем Людовиком, Галичина перейшла під владу угорського монарха, який хотів включити її до складу Королівства Угорського, зустрівши опір польських можновладців. 1387 року донька Людовика, польська королева Ядвіґа Анжуйська, після військового походу захопила ці землі для Польщі.\n\n1379 року Львів, що лежав на важливому відтинку Великого шовкового шляху з Криму до Німеччини, отримав «абсолютне право складу». Воно передбачало, що всі купці, які везли товари через місто, були зобов'язані впродовж двох тижнів виставляти свій крам на продаж у Львові, а вже потім могли їхати далі. Місто стало важливим ремісничим і торговельним центром. Відомими були ярмарки на день св. Аґнеси (21 січня) та св. Маргарити (13 липня), пізніше святоюрські.\n\n1434 року автономія Галичини як Королівства Руського була скасована, а на більшості його земель утворено Руське воєводство з центром у Львові. У XV ст. Львів був Лемберґом: місто мало «німецьке обличчя», німецькою мовою «ґмінна рада» видавала ухвали, велися дискусії, виголошували промови в костелах. Полонізація міста почалася за правління двох останніх Ягеллонів.\n\nЧерез посилення експансії Османської імперії до Європи обсяги торгівлі через Львів значно зменшилися, що спричиняло збідніння міста. Падіння Константинополя сприяло появі в місті багатьох греків. Великим ударом стала пожежа 1527 року, найстрашніша в історії міста, коли готичний Львів вигорів дотла. Для відбудови були запрошені архітектори з Північної Італії, які застосовували ренесансний стиль. Торговельні шляхи занепали, тому відновлення економіки міста було пов'язане з розвитком місцевого виробництва. Основними продуктами експорту стали риба, віск та хутро, зокрема, соболі.\n\nУ другій половині XVI століття у Львові починають діяти Успенське православне братство та школа при ньому, тут веде свою діяльність першодрукар Іван Федорович. Станом на 1630 рік у місті проживало 25—30 тис. мешканців, що робило його найбільшим містом на території сучасної України.\n\nВажливим також був 1661 рік, коли львівська Колегія єзуїтів отримала статус університету.\n\nОднак, починаючи зі середини XVII століття місто переживає спустошливі війни. 1648 — українське козацьке військо Богдана Хмельницького обложило Львів, козаки Максима Кривоноса штурмом взяли Високий Замок, уперше за всю його історію. 1704 року шведські війська під керівництвом короля Карла XII під час Великої Північної війни здобули укріплений центр міста (також уперше в його історії) і пограбували його. Після цього Львів почав хилитися до занепаду.\n\n1772 року внаслідок першого поділу Речі Посполитої Львів відійшов до складу Габсбурзької монархії, ставши столицею коронної провінції — Королівства Галичини і Лодомерії. Австрійська влада впорядкувала міське господарство, у 1777–1820 роках було знесено міські мури, споруджувалися нові квартали у стилі класицизму. Під час австрійського панування в місті активно розвивалася наука і культура: було збудовано два великі театри, реорганізовано Університет і відкрито Політехніку, організовано видавничу справу, запроваджено вуличне освітлення, громадський транспорт, залізничне сполучення. У цей період у Львові було винайдено гас і гасову лампу, запущено першу в світі повітряну кулю на рідкому паливі, споруджено перший в Європі залізобетонний міст.\n\nПід час революції «Весни народів» у Європі 1848 року повстала польська патріотична верхівка. Руське населення також створило власні репрезентативні структури. Урешті, Відень був змушений піти на поступки і надати автономію Королівству Галичини і Лодомерії. З цим починається новий розквіт міста. Львів став центром українського та польського національних визвольних рухів, адже закони в Австро-Угорщині були демократичнішими, ніж у Росії чи Пруссії, у складі яких перебували решта польських та українських земель.\n\nПід час Першої світової війни у 1914–1915 роках Львів був окупований Російською імперією. Тут перебував адміністративний центр Галицько-Буковинського генерал-губернаторства.\n\n10 лютого 1918 р. в місті пройшла велика українська маніфестація на площі Ринок на честь укладення Берестейського мирного договору з УНР; з балкона «Просвіти» учасників привітав Кость Левицький, лунало «Вже воскресла Україна…». 12 лютого 1918 р. в залі «Української бесіди» відбулося зібрання української громадськості, де обговорили ставлення українців Львова до миру з УНР, схвалили: укладення миру між УНР та сусідами; повернення Холмщини, Підляшшя до Української держави; текст телеграми УЦР, Українській Раді Народних Міністрів, Українській Мировій Делегації. Радість українців Львова занепокоїла поляків (професорів, доцентів університету та інших), 14 лютого було підступно побито дружину четаря УСС Стефанію Новаківську. 3 березня 1918 року в місті відбулося «свято державності і миру» (віче) на підтримку дій уряду УНР, на якому були присутні близько 60 000 осіб.\n\nУ ніч на 1 листопада 1918 року у місті відбулося взяття українцями влади — (Листопадовий чин), унаслідок чого 13 листопада 1918 року була офіційно проголошена Західноукраїнська Народна Республіка зі столицею у Львові. Переважання в місті польського населення та бажання поляків відновити кордони Речі Посполитої спричинило Польсько-українську війну, яка завершилася окупацією Галичини і приєднанням до Польщі. Львів став адміністративним центром Львівського воєводства.\n\nЛьвів у складі міжвоєнної Польщі був великим культурним та науковим центром. Місто поповнилося новими районами (Левандівка, Новий Львів, Персенківка, Нове Знесення та ін.). У Львові витворилася автохтонна міська вулична культура (батяри, львівський шансон), з того часу з'явилася традиція називати Львів «маленьким Парижем». Більшість населення становили поляки 64 %; частка євреїв становила близько 25 %, українців — близько 7-9 % населення міста. Проти українців, як і по всій Галичині, проводилася дискримінаційна політика пацифікації, що породила спротив населення і виникнення українських радикальних партій, зокрема Організації українських націоналістів під проводом Євгена Коновальця. У цей період Львів стає центром українського визвольного руху і втримує цей статус до 1990-х років.\n\n1939 року згідно з пактом Молотова — Ріббентропа Львів і Галичина були окуповані Радянським Союзом і ввійшли до складу Української Радянської Соціалістичної Республіки. Місто стало адміністративним центром Львівської області. У червні 1941 року Львів був окупований нацистською Німеччиною і став центром дистрикту Галичина в складі генерал-губернаторства, що було організоване на території колишньої Польщі. Українські націоналісти проголосили 30 червня 1941 року на площі Ринок у Львові Акт відновлення Української держави, проте німецька адміністрація розпочала проти них терор. Німці винищували також польську (Убивство львівських професорів) інтелігенцію, а внаслідок Голокосту загинуло майже все єврейське населення Галичини. 1942 року українські націоналісти створили Українську Повстанську армію, яка почала військові дії проти німців. Від листопада 1943 року нею командував Роман Шухевич. Улітку 1944 року УПА та Армія Крайова намагалися взяти місто під свій контроль, зокрема, на ратуші висів прапор Польщі, однак, 27 липня 1944 року Львів зайняла Червона Армія.\n\nУнаслідок війни Львів упродовж 1946 року покинула більшість поляків, що населяли місто. Відбувся так званий обмін населенням із Польщею. На їхнє місце прибули українці зі Сходу, переселенці з Росії й російськомовні євреї. Проти УПА велася нещадна війна, що супроводжувалася жорстокими репресіями проти місцевого українського населення. 5 березня 1950 року Роман Шухевич загинув на конспіративній квартирі в околицях Львова у Білогорщі.\n\nРадянська влада індустріалізувала Львів, звівши ряд промислових гігантів у місті. Сюди в 1950-х і особливо у 1960-х роках масово переселяються українці з навколишніх сіл. Було збудовано великі спальні райони, як-от Сихів, Рясне, Збоїща, на вулицях Любінській, Науковій, ін. У Львові вкотре змінилося населення. Тепер він став найбільшим україномовним містом (близько 80 % мешканців) і центром національно-визвольного руху, який привів до проголошення незалежності України 24 серпня 1991 року.\n\nУ 1990-х відбувається розвал великих підприємств і триває затяжна економічна криза. Львів зберігає значення як великий культурно-релігійний, освітній і науковий центр, розвивається сфера послуг, зокрема туризм. У місті з 1994 року проводять щорічний Форум видавців. Серед знакових подій початку 2000-х: візит Папи Римського Івана Павла II 2001 року (богослужіння у Львові за його участі зібрало кілька сотень тисяч вірян) та Скнилівська трагедія під час авіашоу 2002 року, яка забрала життя 77 людей.\n\nЛьвів'яни брали активну участь у Помаранчевій революції та Революції гідності. 1 грудня 2013 року на майдані перед пам'ятником Тарасові Шевченку — традиційному місці проведення міських мітингів — у вічі взяло участь понад 50 тисяч осіб. Львів збирав другі за чисельністю мітинги серед усіх міст України (після Києва).\n\nЛьвів став одним із міст-господарів чемпіонату Європи з футболу 2012 року, в рамках підготовки до якого збудовано новий термінал аеропорту та футбольний стадіон.\n\n2016 року запущено трамвай на Сихів, що сполучив найбільший спальний район із центром міста. У 2010-х активно триває будівництво торгово-розважальних і житлових комплексів, старі промислові об'єкти переобладнують у відкриті багатофункціональні простори та офісні центри. Водночас, невирішеною залишається низка інфраструктурних і побутових проблем, наприклад, проблема переробки сміття після закриття Грибовицького сміттєзвалища.",
            "climate_description": "Львівський клімат є помірно континентальним з м'якою зимою і теплим літом. Середньомісячна температура повітря становить −3 °C у січні і +19 °C у липні. Загалом за останні 100—120 років температура повітря у Львові має тенденцію до підвищення. За цей період середньорічна температура підвищилася принаймні на 1 °C. Вологість повітря в середньому за рік становить 79 %. Найчастіше дмуть західні вітри, найрідше — північно-східні. Львів характеризується найбільшою кількістю опадів і найнижчими літніми температурами серед усіх обласних центрів України, що спричинено чи не найменшою континентальністю місцевого клімату з-поміж великих міст України. У середньому за рік випадає 767 мм атмосферних опадів: найменше — в січні, найбільше — в липні. За рік у місті в середньому 174 дні з опадами. Через це місто часто називають «приреченим на дощ». Тема львівського дощу є популярною в місцевих художників, поетів і музикантів. Для всіх пір року характерні різкі перепади атмосферного тиску, температур і вологості повітря. Зими м'які — морози нижче −20 °C спостерігаються вкрай рідко. Стійкий сніговий покрив встановлюється не кожної зими. Весна прохолодна та дощова, заморозки і снігопади можливі до початку травня. Літо прохолодне. Звичайні літні полуденні температури в межах +20-25 °C, спека вище +30 °C спостерігається рідко. Влітку частими є грозові зливи і різкі перепади температур при проходженні атмосферних фронтів. При цьому майже щороку спостерігаються ураганні вітри, які призводять до повалення дерев, обриву ліній електропередач, невеликих руйнувань. Осінь помірно тепла і суха. Мікроклімат центральної частини міста, яка розташована в улоговині, характеризується нижчими мінімальними та вищими максимальними температурами. Для підвищених околиць характерні сильні вітри.",
            "districts_description": "Адміністративно Львів поділяється на 6 районів: центральна частина належить до Галицького району, західна — до Залізничного, північна — до Шевченківського, східна — до Личаківського, південно-східна — до Сихівського, а південна — до Франківського. Разом з цим, у вжитку збереглися давні назви частин міста та сільських місцевостей, які увійшли з часом до складу міста, як-то Левандівка, Білогорща, Збоїща, Рясне, Майорівка, Вулька, Новий Львів, Снопків, Боднарівка, Пирогівка, Козельники, Сихів та інші. Деякі з них відображені сьогодні у назвах вулиць. У підпорядкуванні Львівської міської ради також перебувають місто Винники і селища міського типу Брюховичі та Рудне.",
            "economics_description": "",
            "landmarks": [

                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                ""
            
            ]
        },
        {
            "id": 5,
            "name": "Ужгород",
            "region": "Закарпатська область",
            "year": 1200,
            "population": 120000.0,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/uzhgorod_1.jpg", "name": ""}, 
                {"file": "../assets/uzhgorod_2.jpg", "name": ""},
                {"file": "../assets/uzhgorod_3.jpg", "name": ""},
                {"file": "../assets/uzhgorod_4.jpg", "name": ""},
                {"file": "../assets/uzhgorod_5.jpg", "name": ""},
                {"file": "../assets/uzhgorod_6.jpg", "name": ""},
                {"file": "../assets/uzhgorod_7.jpg", "name": ""},
                {"file": "../assets/uzhgorod_8.jpg", "name": ""}
            ],
            "short_description": "Одне з найрозвинутіших міст Заходу України",
            "history_description": "",
            "climate_description": "",
            "districts_description": "",
            "economics_description": "",
            "landmarks": [

                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                ""
            
            ]
        },
        {
            "id": 6,
            "name": "Одеса",
            "region": "Одеська область",
            "year": 1200,
            "population": 700000.0,
            "oldnames": "Хаджибей",
            "photos": [
                {"file": "../assets/odessa_1.jpg", "name": ""}, 
                {"file": "../assets/odessa_2.jpg", "name": ""},
                {"file": "../assets/odessa_3.jpg", "name": ""},
                {"file": "../assets/odessa_4.jpg", "name": ""},
                {"file": "../assets/odessa_5.jpg", "name": ""},
                {"file": "../assets/odessa_6.jpg", "name": ""},
                {"file": "../assets/odessa_7.jpg", "name": ""},
                {"file": "../assets/odessa_8.jpg", "name": ""}
            ],
            "short_description": "Одне з найрозвинутіших міст Півдня України",
            "history_description": "",
            "climate_description": "",
            "districts_description": "",
            "economics_description": "",
            "landmarks": [

                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                "",
                ""
            
            ]
        }
    ]
}