{
    "locations": [
        {
            "id": 0,
            "name": "Чернігів",
            "region": "Чернігівська область",
            "year": 907,
            "population": 280000.0,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/chernihiv_2.jpg", "name": "Гармата Валу"}, 
                {"file": "../assets/chernihiv_1.jpg", "name": "Свято-Троїцький собор"},
                {"file": "../assets/chernihiv_3.jpg", "name": "Чернігівський колегіум"},
                {"file": "../assets/chernihiv_4.jpg", "name": "П'ятницька церква"},
                {"file": "../assets/chernihiv_6.jpg", "name": "Будівля Чернігівського обласного філармонійного центру"},
                {"file": "../assets/chernihiv_7.jpg", "name": "Адміністративна будівля в центрі міста"},
                {"file": "../assets/chernihiv_8.jpg", "name": "Чернігівський Дитинець"},
                {"file": "../assets/chernihiv_10.jpg", "name": "Будівля залізничного вокзалу"}
            ],
            "short_description": "Черні́гів — місто в Україні, адміністративний центр Чернігівської міської громади, обласний та районний центр Чернігівської області, Місто-герой. Найпівнічніший обласний центр України.\n\nНалежить до найдавніших міст України, заснований у кінці VII століття (хоча перша згадка датується 907 роком) при впаданні річки Стрижень у Десну. Чернігів у часи Середньовіччя — одне з головних міст Київської Русі та, за оцінками істориків, одне з найбільших міст тогочасної Європи, столиця Чернігівського князівства, до володінь якого належали, зокрема Кубань, Керченський півострів, Муром, Рязань і частина нинішнього Підмосков'я. За козацької держави Богдана Хмельницького стало головним містом Чернігівського полку. Завдяки діяльності чернігівських архієпископів Лазара Барановича й Іоанна Максимовича та підтримці гетьмана Івана Мазепи Чернігів перетворився на один із значних осередків освіти й культури в Україні. У місті, зокрема, діяв Чернігівський колегіум — перший вищий навчальний заклад на території Лівобережної України.\n\nЧернігів славиться своїми пам'ятками часів Русі та Гетьманщини. Історичний центр Чернігова є кандидатом на внесення до переліку об'єктів Світової спадщини ЮНЕСКО.",
            "history_description": "За переказами і легендами, Чернігів отримав назву на честь першого місцевого князя — Чорного. На сьогодні відомо багато різних легенд і переказів пов'язаних із назвою міста. За одними з них, назва міста пов'язується із ім'ям дочки цього ж князя «Чорного», яка викинулася з вікна княжого терему, щоб уникнути наруги з боку ворогів, які стояли облогою навколо міста. Інші легенди кажуть, що Чернігів завдячує своєю назвою темним, дрімучим, «чорним», лісам, які з усіх боків оточували місто. Також існує версія про велику кількість «серн», тобто сарн, які населяли околиці цієї місцевості. І ніби, з часом, назва міста змінилася з Сернігів на Чернігів.\n\nНа території сучасного Чернігова виявлені сліди заселення з неоліту і бронзової доби. Наприкінці VII століття в середній течії річки Десна тут виникло укріплене городище.\n\nВперше Чернігів згадується в літописі під 907 роком в «трактаті князя Олега з греками». У ранньому середньовіччі місто було укріпленим городищем, а з IX століття увійшло до складу Київської Русі.\n\nУ XI—XIII століттях Чернігів був центром Сіверщини і Чернігівського удільного князівства. Першим у ньому господарював Мстислав Володимирович, брат Ярослава Мудрого. Після його смерті Чернігів опанував його брат Ярослав, а згодом племінник Святослав Ярославич, родоначальник чернігівської княжої династії Святославичів.\n\nУ княжу добу Чернігів знаходився на плато між річкою Десною та її притокою Стрижнем. У центрі міста був розташований замок із княжим двором — дитинець, до якого прилягав окольний град — передгороддя і район Третяк, де мешкали купці й ремісники. Кожна частина Чернігова мала свої оборонні вали. Над Десною лежав торговий Поділ. У середині XII століття територія міста без Подолу становила близько 120 га. Управління чернігівської княжої династії створювало належні умови для розвитку культури міста і залежних володінь. Це відбилося насамперед на архітектурі й образотворчому мистецтві. Чернігівські монументальні будови XI—XII століть, особливо церкви і собори, були видатними пам'ятками тієї доби. У першій половині XI століття в центрі дитинця постав Спасо-Преображенський собор. Протягом XII століття — початку XIII століття побудовано собор Бориса й Гліба (Чернігів), Іллінську, Благовіщенську, Михайлівську церкви, Успенський собор Єлецького монастиря, П'ятницьку церкву. Чернігівці княжої доби залишили свій слід також у літературі Русі. Зокрема, чернігівський ігумен Данило є автором опису мандрівки до Святої Землі кінця XI — поч. XII століття. Уривки Чернігівського літопису, що не зберігся, знаходимо у пізніших літописних збірниках.\n\n1239 року місто було зруйноване монголо-татарами й занепало. Монгольська навала перервала зростання Чернігова на тривалий час. Місто опинилося в складі держави Золотої орди. Центром Сіверської землі став Брянськ.\n\nУ 1353 році Чернігів увійшов до складу Великого князівства Литовського і Руського, а у 1503 році був завойований Московією. Завойовники звели на узбіччях дитинця фортецю і розбудували передгороддя.\n\nЧернігів не раз зазнавав руйнації від нападів татар. Особливо місто постраждало під час їхніх походів у 1482 і 1497 роках.\n\nУ 1618 році за Деулінським перемир'ям Чернігів перейшов від Московії до Речі Посполитої. У 1623 році місто отримало магдебурзьке право, магістрат і герб, а з 1635 року стало центром Чернігівського воєводства.\n\nСоціокультурний розвиток Чернігова у XIV — XVI століттях гальмувався через постійні війни Великого князівства Литовського і Руського та Московії. Ці держави боролися за домінування у Східній Європі, перманентно спустошуючи Чернігівщину і Сіверщину. Перші паростки культурного відродження з'явилися із настанням XVII століття. Зокрема, архімандрит Єлецького монастиря Кирило Ставровецький збудував у 1646 році в Чернігові першу друкарню.\n\nЧернігів став одним із перших міст, яке отримало повідомлення про повстання Богдана Хмельницького.Доведені до відчаю магнатсько-шляхетською тиранією селяни й міщани часто створювали свої окремі загони на місцях і «пановъ своїхъ… ляховъ… ксєндзовъ позабїяли (костелы) попустошили». Стихійний рух поступово переростав у організоване повстання. Слід зазначити, що в місті перебувала шляхта майже зі всього Лівобережжя. Великий магнат Ярема Вишневецький, тікаючи від повстанців, зупинявся в Чернігові й схиляв шляхту на свій бік, пропонуючи йти разом із ним за Дніпро, на Правобережжя. Однак чернігівська шляхта, не усвідомлюючи ще всієї небезпеки й покладаючись на захист навколишніх лісів, залишилась, сподіваючись відсидітись у міцному замку. Та наприкінці травня козаки підступили до міста, а 13 червня вже стало відомо про облогу Чернігова повстанцями. За свідченням джерел, облога Чернігова тривала три тижні. І замок не витримав її. Згідно з відомостями анонімного кореспондента із Варшави від 2 серпня, сусідні з Черніговом міста також здавалися козакам, «выдавая ѣм на муки шляхту католиковъ»; в одному з них «больше чем 800 шляхты вырублено». Однак під час Визвольної війни Чернігів іще довго продовжував бути ареною для боротьби з лядським військом, магнатами й шляхтою. Становище склалося таким чином, що після Зборівського договору 1649 р. Чернігівщина знову повернулася під контроль польської знаті. На початку 1651 р. боротьба відновилася. Тут було зосереджено 20 000 осіб Чернігівського полку Мартина Небаби. Після звільнення Чернігова козаки намагалися взяти Гомель, але були розбиті у бою під Ріпками. У результаті численних боїв військові сили України значно вичерпалися. Богдан Хмельницький змушений був піти на підписання миру. 18 вересня 1651 р. підписано Білоцерківський договір. Після цього коронне військо Речі Посполитої знову окупувало Чернігівщину.\n\nПіднесення життя Чернігова почалося, коли він увійшов до складу Козацько-Гетьманської Держави і став центром Чернігівського полку. На цей час припадає розквіт культурного життя Чернігова, він став одним із найважливіших культурних центрів України.\n\nКультурне відродження Чернігова пов'язане з діяльністю архієпископа Лазаря Барановича, який переніс до Чернігова друкарню, закладену ним у Новгороді-Сіверському в 1675 році. Навколо Барановича утворився літературно-мистецький гурток, до якого належали: архімандрит Єлецького монастиря Іоанікій Галятовський, архідиякон Чернігівської єпархії Антоній Радивиловський, ієромонах Чернігівського Троїцько-Іллінського монастиря Л. Тоболинський, поет Іван Величковський, майбутній архієпископ чернігівський Іван Максимович; гравери: Іван Інокентій Щирський, Леонтій Тарасевич, Н. Зубрицький; архітектори Адам Зерніков, Іоганн-Баптист Зауер (Іван Баптист) та інші.\n\nЗ ініціативи Л. Барановича й коштом гетьманського уряду й чернігівської козацької старшини, відновлено і перебудовано в бароковому стилі чернігівські пам'ятки, зокрема Троїцький кафедральний собор (16 ст.). Особливе значення мало створення Чернігівського Колегіуму (1700), який став одним із головних осередків освіти і науки Гетьманщини. У першій половині 18 ст. в Чернігові з'являються нові монументальні споруди: релігійні (барокова Катерининська церква, 1715) й світські (будинок полкової канцелярії, відомий під назвою «Мазепиного будинку» або будинок Якова Лизогуба) будови. У 1783 році збудовано один із перших мостів Чернігова — Красний міст через річку Стрижень.\n\nУ 1782 Чернігів став центром Чернігівського намісництва Російської імперії, а 1797 — Малоросійської губернії, з 1808 - Чернігівської губернії. Тоді місто нараховувало близько 4000 мешканців, у 1844 році їх кількість збільшилася до 12 000, 1897 — до 27 000, 1913 — до 35 000. Економічний характер тогочасного Чернігова був адміністративно-торгівельно-ремісничий: дрібна місцева харчова промисловість, цегельні, свічковий і миловарний завод тощо. Чернігів поширювався в західному і північно-західному напрямі.\n\nХоча Чернігів не був великим містом, він і далі, у другій половині XVIII століття зберігає значення великого культурного центру. На культурному ґрунті Чернігова наприкінці XVIII — на початку XIX століття згуртувалося коло українських «дворянських патріотів», які боронили автономні права України й вимагали визнання дворянських прав для козацького стану: А. Полетика (чернігівський губ. маршал), аматор-історик А. Чепа (товариш малоросійського поштмейстера), Р. Маркевич і Т. Калинський. Вони досліджували історію України, збирали історичні документи, літописи й на підставі їх складали записки про історію й права українського шляхетства, які поширювали на всій території Лівобережної України.\n\nТа найбільше розгорталося культурне життя Чернігова від другої половини XIX століття. На відміну від попередньої епохи з її перевагою локальних і станових дворянських інтересів і прагнень, воно чимраз далі набирало загальнонаціонального українського характеру. У Чернігові працювали історики: О. Лазаревський, граф. Г. Милорадович, О. Ханенко, брати Микола і Митрофан Константиновичі, А. Верзилов, П. Дорошенко та ін.; етнографи О. Маркевич, О. Шишацький-Ілліч, С. Ніс, байкар Л. Глібов, статистики — О. Русов, В. Варзар, П. Червінський, В. Шликевич та ін. Дехто з них належав до Чернігівської Громади, однієї з найрадикальніших в Україні.\n\nБув Чернігів і видавничим центром. Ще з 1858 там почав виходити орган губернатора — тижневик «Черниговские Ведомости» (до 1917). У 1861—1863 pp. Л. Глібов видавав «Черниговскій Листокъ», єдину тоді на Чернігівщині Україні українську газету. Від 1861 до 1911 виходили також «Черниговские єпархиальные известия», а в 1868—1872 роках «Записки» Чернігівського Статистичного Комітету.\n\nЗа переписом населення 1897 року в Чернігові жило 11 000 євреїв (усе населення 27 000). Вони були зайняті переважно в промисловості і комерції, а також займалися садівництвом і вирощували тютюн.\n\nПід кінець XIX століття культурне життя Чернігова значно активізувалося. Головними його осередками були Чернігівське земство і його статистичний Комітет, Губерніальна Архівна Комісія (заснована 1896 з ініціативи О. Лазаревського й Г. Милорадовича), яка у своїх «Трудах» 1897—1915 рр. видала багато документів, Музей Тарновського, подарований його фундатором В. Тарновським (молодшим). У Чернігівському земстві навколо цих установ об'єднувалися місцеві науковці, педагоги, письменники, митці, діяльність яких нерідко виходить за межі Чернігівщини.\n\nНа межі XIX і XX століть жили у Чернігові письменники: М. Коцюбинський (похований у Чернігові), Б. Грінченко, В. Самійленко, М. Вороний, М. Чернявський, маляр І. Рашевський, історик В. Модзалевський та ін. Коло цих визначних діячів гуртувалася й виховувалася українська молодь, здебільшого вихованці Чернігівської гімназії й Духовної семінарії. У 1911 році відбувся в Чернігові XIV Археологічний З'їзд. 1916 засновано Педагогічний Інститут.\n\nПід час радянсько-української війни 1917 року в Чернігові створено загони Вільного Козацтва і влада перейшла в руки Центральної Ради. За української влади пожвавилось українське культурне життя (видавництво «Сіверянська думка», щоденник губернського земства «Чернігівщина», орган губернської Ради Селянських Депутатів «Народне Слово», українські школи тощо). Першого лютого 1918 року Чернігів захопило більшовицьке військо; 12 березня 1918 року він повернувся під владу уряду Української Народної Республіки, але знов був окупований більшовиками 12 січня 1919 року. Від 13 жовтня до 12 листопада 1919 року Чернігів був у руках денікінців. Наприкінці 1919 року в Чернігові було остаточно встановлено радянську владу. У 1925—1932 Чернігів був центром Чернігівської округи, а з 1932 року - обласним центром новоствореної Чернігівської області. За переписом 1926 року, Чернігів нараховував 35 200 мешканців, у тому числі 57 % українців, 20 % росіян і 10 % євреїв. За доби п'ятирічок завдяки зростанню промисловості населення Чернігова збільшилося до 69 000. Чернігів зберігає своє значення культурного центру в 1920-х і на початку 1930-х років. Тут діяли: Історичний музей (колишній музей Тарновського, значно збагачений), архів Наукового Товариства Інститут Народної Освіти (з 1920). Діяльність цих установ була щільно пов'язана з ВУАН, зокрема з її історичною секцією та Археологічним Комітетом, з центральними історичними архівами у Києві й Харкові, Інститутом Української Культури ім. Д. Багалія (Харків) та ін. 1926 року відкрито театр ім. Шевченка. З Черніговом пов'язані імена письменників: П. Тичини, І. Кочерги, В. Еллана-Блакитного, А. Заливчого, І. Коваленка; істориків П. Савицького, Є. Онацького, В. Дубровського, В. Шугаєвського, мистецтвознавця О. Гукала тощо. Місто постраждало під час проведеного радянською владою Голодомору 1932—1933 років, 30 березня 1933 року на «чорну дошку» занесений Чернігівський ліспромгосп, померло щонайменше 3602 жителі Чернігова.\n\nУ роки Другої світової війни місто опинилося під німецькою окупацією. Всього за час окупації були вбиті 52453 жителів міста і полонених солдат. 695 осіб були вивезені на примусові роботи в Німеччину. У січні 1942 р. в місті почала діяти група підпільників, яку очолив А. Д. Михайленко, по професії радіотехнік. На заводі «Октябрьский молот» в перші місяці 1942 р. також була організована підпільна група, на чолі з Н. С. Шарим. Робітники займались саботажем виробництва, за що Шарого заарештували і після допитів відправили у табір Дахау. 21 вересня 1943 року Чернігів зайняли радянські війська.\n\nПісля Другої світової війни Чернігів відбудовано за генеральним планом (1945, 1958 і 1968) і реконструйовано. Центр міста зовсім перебудовано у 1950—1955 роках (архітектори П. Буклавський, І. Ягодовський). Населення Чернігова зростало швидко: 1959 — 89 585 осіб (у тому числі українці становили 69 %, росіяни — 20 %, євреї — 8 %, поляки — 1 %), 1970 — 158 873 осіб, 1980 — 245 000 осіб. Промисловість Чернігова досягла довоєнного рівня на початку 1950-х років.\n\nУ 1990 році в Чернігові відбулася Ковбасна революція — стихійний виступ жителів міста проти діючої влади у різдвяні дні 1990 року. Події набули широкого резонансу, породили низку аналогічних акцій в інших містах Радянського Союзу. Результатом подій стала зміна обласного і міського партійного керівництва, посилення авторитету опозиційних політичних сил. Ця подія стала однією з передумов незалежності України.\n\n21 листопада 2013 р. в Києві на Майдані Незалежності розпочався мітинг на знак протесту проти рішення уряду України заморозити переговори з Євросоюзом щодо угоди про асоціацію. Чернігів приєднався до Євромайдану вже 22 листопада. О 16-й годині під будинком Чернігівської ОДА зібралось близько сотні громадян. Але вже за годину усі розійшлися — завадив дощ. 7 грудня 2014 р. з 13-00 до 15-00 був мітинг, на якому було до 1000 осіб.  20 лютого 2014 р. на молебні про жертв виступів у Києві (Небесна сотня) зібралась повна площа людей. Через декілька днів буде скинуто пам'ятник Леніну в центрі міста",
            "climate_description": "Чернігів знаходиться в західній частині Чернігівської області. Місто розташоване у Придніпровській низовині, на правому березі річки Десни. Вздовж міста протікає річка Стрижень. Чернігів знаходиться в зоні, яка характеризується континентальним кліматом. Найтепліший місяць — липень із середньою температурою 18,9 °C. Найхолодніший місяць — січень, з середньою температурою −5,6 °С. Оскільки Чернігів розташований неподалік від болотянї місцевості на півночі Чернігівщини, то у травні-червні кожного року спостерігається велика кількість комарів, особливо у прибережних зонах.",
            "districts_description": "Чернігів поділяється на 2 райони: Деснянський та Новозаводський. Райони ділять місто навпіл (межа проходить по проспекту Миру): Деснянський — східна частина, Новозаводський — західна частина міста. У місті налічується орієнтовно 550 проспектів, вулиць, бульварів, площ, провулків, скверів та узвозів. А саме: близько 400 вулиць, 100 провулків, 2 проспекти (Миру та Перемоги). Вулиці та провулки можна умовно поділити, бо місто поділене на 2 райони.",
            "economics_description": "Провідні галузі промисловості в Чернігові: хімічна, харчова, легка, будівельних матеріалів, деревообробна. Наявний також автозавод, який займається виготовленням автобусів та тролейбусів (ПрАТ «Чернігівський автозавод»)\n\nЗа даними опитування, проведеного Соціологічною групою «Рейтинг» у 2017 році, українці становили 91% населення міста, росіяни — 7%. Крім того, приблизно 1% від населення складають білоруси. Також станом на 2017 рік українською вдома розмовляли 18 % населення міста, російською — 53 %, українською та російською в рівній мірі — 28 %. Відповідно до результатів опитування, проведеного Міжнародним республіканським інститутом у квітні-травні 2023 року, українською вдома розмовляли 53 % населення міста, російською — 41 %.",
            "landmarks": [
                "Чернігівський Дитинець (Вал) та історичні гармати",
                "П'ятницька церква ПЦУ",
                "Катерининська церква ПЦУ",
                "Красний міст",
                "Красна площа",
                "Болдині гори",
                "Антонієві печери",
                "Стрілецька набережна річки Стрижень",
                "Регіональний ландшафтний парк 'Ялівщина'",
                "Набережна річки Стрижень на вулиці Георїв Чорнобиля"
            ]
        },
        {
            "id": 1,
            "name": "Київ",
            "region": "Київська область",
            "year": 482,
            "population": 2952301,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/kyiv_1.jpg", "name": "Софіївська площа"}, 
                {"file": "../assets/kyiv_2.jpg", "name": "Михайлівський Золотоверхий собор"},
                {"file": "../assets/kyiv_3.jpg", "name": "Вид на лівий берег Дніпра"},
                {"file": "../assets/kyiv_4.jpg", "name": "Храми над Дніпром"},
                {"file": "../assets/kyiv_5.jpg", "name": "Комплекс Києво-Печерської лаври"},
                {"file": "../assets/kyiv_6.jpg", "name": "Софіїська дзвіниця"},
                {"file": "../assets/kyiv_7.jpg", "name": "Червоний корпус Київського національного університету"},
                {"file": "../assets/kyiv_8.jpg", "name": "Маріїнський палац"}
            ],
            "short_description": "Ки́їв — столиця та найбільше місто України. Розташований у середній течії Дніпра, у північній Наддніпрянщині. Політичний, соціально-економічний, транспортний, освітньо-науковий, історичний, культурний та духовний центр України. У системі адміністративно-територіального устрою України Київ має спеціальний статус, визначений Конституцією, і не входить до складу жодної області, хоча і є адміністративним центром Київської області. Місце розташування центральних органів влади України, іноземних місій, штаб-квартир більшості підприємств і громадських об'єднань, що працюють в Україні.",
            "history_description": "Ки́їв — столиця та найбільше місто України. Розташований у середній течії Дніпра, у північній Наддніпрянщині. Політичний, соціально-економічний, транспортний, освітньо-науковий, історичний, культурний та духовний центр України. У системі адміністративно-територіального устрою України Київ має спеціальний статус, визначений Конституцією, і не входить до складу жодної області, хоча і є адміністративним центром Київської області. Місце розташування центральних органів влади України, іноземних місій, штаб-квартир більшості підприємств і громадських об'єднань, що працюють в Україні. За легендою «Повісті временних літ», Київ заснував легендарний полянський князь Кий разом із братами Щеком і Хоривом і сестрою Либіддю. Літопис не має дати заснування міста. Археологічні та писемні джерела свідчать, що Київ розвинувся на основі язичницького поселення й початок його безперервого розвитку датується 2-ю половиною V — 1-ю половиною VI століття. Згідно інформації, приведеній в книзі археології Києва, місто засноване в кінці V, початку VI століття. Його центром була Старокиївська гора на правому березі Дніпра. У VI—VII століттях були заселені сусідні з нею підвищення. Розташовування Києва на Дніпровському шляху, у зоні етнічного порубіжжя, на межі лісу і лісостепу, сприяли висуненню міста на роль політичного центру Середнього Подніпров'я.\n\nНа межі VIII—IX століть Київ став головним містом Руської землі — міжплемінного об'єднання південних східнослов'янських племен, а з 882 року, після завоювання його варягами, — «матір'ю міст руських» — столицею Руської держави. Тоді ж сформувався середньовічний поділ міста на князівський Дитинець на Старокиївській горі та торговельно-ремісничий Посад на Подолі. В першому мешкала знать і духовенство, а в другому — простолюд. Місто було одним із центрів міжнародної торгівлі з Візантією, Скандинавією, Західною Європою, мусульманським світом. З першої половині X століття на Подолі діяла перша християнська церква.\n\nЗа правління великого князя Володимира (980—1015) територія київського Дитинця була розширена і укріплена та сягнула 10 га. В історіографії її називають «городом Володимира». Дитинець оточував вал із трьома воротами, парадними з яких були Софійські[3]. Після хрещення Русі в 988 році Київ став центром митрополії Константинопольського патріархату. Головним міським храмом була Десятинна церква, зведена неподалік княжого палацу і ринку «Бабин торжок». Син Володимира, Ярослав (1019—1054), ще більше розширив Дитинець, збудувавши і оточивши оборонними валами з ровами так званий город Ярослава. Він звів нові фортечні укріплення, завдовжки понад 3,5 км, які оточували площу 72 га. Київ перетворили на найбільшу фортецю Русі. Новою головною брамою стали Золоті ворота, а головним храмом — Софійський собор, кафедра київських митрополитів. Ярославові нащадки Ізяслав (1054—1068, 1069—1073) і Святополк (1093—1113) збудували нове укріплення — город Святополка. Його центром став Києво-Михайлівський Золотоверхий собор, що дав назву однойменному монастирю. Таким чином, тодішній Київ мав три фортифікаційні укріплення (городи) площею 80 га.\n\nНайбільшим районом Києва був придніпровський Поділ. У XII—XIII століттях він займав площу близько 200 га, що була оточена оборонним валом[3]. У центрі Подолу розміщувався головний міський ринок — «Торговище», довкола якого стояли церква Пирогоща, Борисоглібська й Михайлівська церкви. На захід від міста пролягав Копирів кінець, де за князювання Святослава Ярославича (1073—1076) заклали монастир святого Симеона. За містом розташовувалися монастирі — Кирилівський, Кловський, Печерський (з 1598 — Києво-Печерська лавра) та Видубицький монастир. Довкола міста тягнулися приміські села Предславине і Берестове, князівські й боярські двори, урочища Дорогожичі та Угорське. На середину XII століття в Києві проживало близько 50 тисяч мешканців, діяло близько 400 церков, 8 базарів. Площа міста становила до 400 га.\n\nУ 1169 році Києвом заволодів владимиро-суздальський князь Андрій «Боголюбський». 1240 року місто захопили монгольські завойовники на чолі з онуком Чингісхана — ханом Батиєм, розвиток міста був перерваний.\n\nПопри спустошення та руйнування під час монгольської навали 1240 року, Київ продовжував грати помітну роль у політичному житті Східної Європи. Хоча чисельність його мешканців різко зменшилася, проте всі його головні історичні райони (Верхнє місто, Поділ, Замкова гора, Печерськ, Берестове, Клов, Видубичі тощо) були заселені. Головне ядро міста (Гора та Поділ) знаходилося в традиційних межах: Золоті та Лядські ворота на Горі та річка Почайна на Подолі. У 2-й половині XIV століття Замкова Гора перетворилася на Дитинець міста.\n\nУ 1321 році, після поразки у битві на річці Ірпінь Великому князю Литовському Гедиміну, князь Станіслав утік до Рязані, а його місце посів Міндовг Гольшанський — перший київський князь із роду Гольшанських.\n\nБлизько 1362 року Київ входить до складу Великого князівства Литовського. Його князем став Володимир Ольгердович. Входження відбувалося мирним шляхом, за договорами, які лишали все «по старовині». Наприкінці XIV — на початку XV століть Київ являє собою політичний центр, де ведуть переговори великі князі литовські, Вітовт, король польський і верховний князь литовський Владислав II Ягайло, великий князь московський Василій Дмитрович, митрополити Кипріян, Фотій, Григорій (Цамблак), хан Тохтамиш. Місто стало головною базою армії Вітовта.\n\nУ 1440 році відновлено Київське князівство на чолі з князем Олельком Володимировичем. У 1455—1470 роках у Києві князював Семен Олелькович. Обидва князі мали авторитет, мали династичні зв'язки з великими московськими та тверськими князями, молдовським господарем Стефаном III Великим. Час їхнього правління став для Києва періодом розвитку (базувався на традиціях матеріальної та духовної культури давньоруської доби): здійснено ремонт Успенського собору та інших церков, створено кам'яні барельєфи із зображенням Оранти, а також нові редакції Патерика Києво-Печерського та інших писемних творів. Київ продовжував бути важливим центром внутрішньої та міжнародної торгівлі, мав право складу. Через місто транзитом ішло багато товарів зі Сходу, Європи, Московії тощо.\n\nКиїв був потенційним центром об'єднання руських земель, що перебували в складі Великого князівства Литовського, тому після смерті київського князя Семена Олельковича литовська влада перетворила князівство на воєводство. 1497 року великий князь литовський і руський Олександр Ягеллончик надав Києву Магдебурзьке право. Наприкінці XV століття в місті існував замок, резиденція київських воєвод, та ратуша, місце засідань київського магістрату. 1569 року, на прохання київської шляхти та за рішенням Люблінської унії між Великим князівством Литовським і Королівством Польським, що утворювала федеративну державу Річ Посполиту, Київ разом із воєводством перейшов до складу Польської корони.\n\nКінець XV століття став початком занепаду Києва, що зумовлювалося загальною кризою Великого князівства Литовського — його нездатністю організувати захист підвладних йому земель від нападів кримських татар, найбільший з яких здійснено 1482 року. Після Люблінської унії, попри тиск з боку польських феодалів і Католицької Церкви, у цей час відбувалося економічне піднесення міста. З 1625 року Київ був центром козацького Київського полку, який 1649 року в результаті Хмельниччини увійшов до складу держави Війська Запорозького. Попри малі розміри Києва, він був найбільшим православним центром Речі Посполитої та козацької держави. У місті розташовувалися резиденція православних київських митрополитів та православний Київський колегіум, який в 1659 році отримав статус академії.\n\nНаступний період історії Києва розпочався окупацією його московськими військами після Переяславського договору 1654 році, укладеного між Військом Запорозьким і Московією. Київ був потрібен московському урядові як «опорний пункт колонізаторської політики на півдні». Київ став резиденцією московських воєвод. 1667 року внаслідок підписання Андрусівського миру, який розділив козацьку державу між Річчю Посполитою і Московським царством, місто увійшло до складу останнього. Формально Київ залишався під владою Війська Запорозького, але фактично містом керувала московська адміністрація. За «вічним миром» 1686 року Київ остаточно відійшов до Московської держави.\n\nРозірвання зв'язків із західними областями України призвело у XVIII ст. до застою в економіці й торгівлі. Від 1782 року Київ став головним містом намісництва, територія якого охоплювала значну частину Гетьманщини. Після 2-го поділу Польщі (1793) і приєднання до Московії західноукраїнських воєводств, 1797 року була утворена Київська губернія. Із Дубна до Києва був переведений щорічний (у січні) Контрактовий ярмарок. Ці події поновили зв'язки Києва із західними областями й сприяли притоку поляків, головно шляхти, що посіла значне місце в житті Києва до польського повстання 1830—1831 років. У цей час московським урядом вживалися заходи для перетворення Києва, шляхом русифікації й витіснення із нього польського та єврейського населення, «на чисто російське місто».\n\nЧерез прикордонний характер Києва в ньому постійно перебувала московська залога. На початку XVIII століття завершено будівництво Печерської фортеці. Київ втратив статус центру Київського полку у зв'язку з перенесенням полкової канцелярії до Козельця. 1708 року місто стало адміністративним центром Київської губернії Російської імперії. З осені 1770 до літа 1771 року Київ страждав від епідемії чуми. Загинуло 2819 людей, переважно на Подолі. Після скасування автономії Війська Запорозького в 1782 Київ остаточно перейшов під владу росіян. Пам'ятками козацької доби в місті лишилися лише мазепинські церкви.\n\nЗа часів правління Російської імперії в XVIII — початку XX століття Київ був великим провінційним містом, п'ятим за величиною серед імперських міст після Санкт-Петербургу, Москви, Варшави й Одеси.У 20-х роках XIX ст. у Києві налічувалося близько 40 000 населення, з яких 18 000 було військових.Після повстання декабристів, 1827 року у Києві засновується генерал-губернаторство, що об'єднувало Київську, Подільську й Волинську губернії, задачею котрого було проведення русифікаторської політики царизму й боротьба проти революційного руху.\n\nНа відміну від попередніх століть, кияни вперше дістали можливість розвивати своє місто в мирних умовах. Російська місцева влада приділяла увагу не лише розбудові історичного Подолу й Старокиївської гори, а й розвитку інфраструктури околиць — Бесарабки, Хрещатика, Печерська тощо. Головною вулицею міста була Володимирська, а центром ділового життя — контрактові ярмарки на Контрактовій площі.\n\nУ XIX столітті в Києві з'являються перший університет й оперний театр, проведено телефон і телеграф, розпочато рух Київського трамвая. Попри ліберальну соціально-економічну політику, імперський уряд проводив жорстку русифікацію місцевого польського, українського і єврейського населення.\n\nУ добу української революції та визвольних змагань Київ був центром боротьби за українську державність. 3 березня 1917 року, після падіння царського режиму, у місті створено Українську Центральну Раду. 20 листопада 1917 року вона III Універсалом проголосила Українську Народну Республіку, а Київ — її столицею. 8 лютого 1918 року містом заволоділи більшовики, проте після укладання Берестейського миру його визволили війська Центральних держав. Протягом 29 квітня — 14 грудня 1918 року Київ був столицею Української Держави, якою керував гетьман Павло Скоропадський. Після повалення гетьманату до 14 лютого 1919 року в Києві базувалася Директорія УНР. У лютому 1919 року місто повторно зайняли більшовики, у серпні — окупували війська Антона Денікіна, а в грудні — знову більшовики. 7 травня 1920 року Київ відвойований союзними силами підрозділів армії УНР та польської армії під час радянсько-польської війни. Однак унаслідок більшовицького контрнаступу остаточно повернувся під радянську владу.\n\nУ 1930-ті роки в Києві запроваджено автобусний і тролейбусний рух, збудовано міст імені Євгенії Бош, уведено в дію першу АТС, організовано центральне опалення.У 1934-му до міста перенесена з Харкова столиця УСРР.Починаючи з 1930-х у Києві почалися Сталінські репресії. Масові страти здійснювалися на території Биківні. Комуністи, що сповідували войовничий атеїзм, зруйнували більшу частину київських унікальних храмів: Михайлівський Золотоверхий монастир, Трьохсвятительську церкву, церкву Богородиці Пирогощої, Богоявленський та Військовий Микільський собори, Воскресенську та Петропавлівську церкви на Подолі, Благовіщенську церкву-дзвіницю Кирилівського монастиря, храми в стилі класицизму Миколи Доброго, Різдва, св. Ольги тощо. На місці зруйнованих пам'яток комуністи масово споруджували пам'ятники своїм ідеологам та героям. Центральною вулицею радянського Києва став Хрещатик.\n\n19 вересня 1941 року, під час Другої світової війни, після 78 днів оборони Київ був напризволяще покинутий радянськими та захоплений німецькими військами. Місто на два роки стало адміністративним центром Київської генеральної, міської та сільської округ. 6 листопада 1943 радянська влада повернула собі місто. У ході боїв Київ сильно постраждав, зокрема через підривні роботи комуністичних партизанів. Відновлювальні роботи тривали до початку 1950-х. У 1948 року завершено будівництво газопроводу Дашава — Київ, а в 1949 споруджено Дарницький залізничний міст та Міст Патона. У 1950 створену першу в СРСР ЕОМ — МЕСМ, а в 1951 розпочав передачі перший в Україні телевізійний центр.\n\nУ 1960 році запущено першу ділянку метрополітену, зведено нові житлові масиви на лівому березі Дніпра. Відкрито Театр драми і комедії та Молодіжний театр, Музей народної архітектури та побуту УРСР, Музей історії Києва та Музей історії України у Другій світовій війні (до 2015 року мав назву «Музей історії Великої Вітчизняної війни»). Разом із тим із середини 1960-х поновилася ідеологічна диктатура, а Київ стає центром дисидентського руху. Припинення репресій та повернення політв'язнів в Україну почалося лише за часів перебудови після 1986 року.\n\nУ 1991 року Київ став столицею незалежної України. Проте в місті важко впроваджувалися позитивні зрушення: давалася взнаки загальнодержавна соціально-економічна криза, що призвела до безробіття та скорочення виробництва. У цей час добудовано лінію метрополітену на Лук'янівку та Харківський масив, відкрито Співоче поле.",
            "climate_description": "Клімат помірно континентальний, із м'якою зимою і теплим літом. Середньомісячні температури січня −3,2 °C, липня - +21.3 °C. Абсолютний мінімум — −32,2 °C (7, 9 лютого 1929 року), абсолютний максимум — +39,9 °C (серпень 1898 року) (за іншими даними: +39,4 °C, 30 липня 1936 року). Середньорічна кількість опадів — 616 мм, максимум опадів припадає на червень (72 мм), мінімум — на січень (37 мм). Взимку в Києві утворюється сніговий покрив, середня висота покриву в лютому 20 см, максимальна — 440 см.",
            "districts_description": "Місто складається з десяти районів. Голосіївський, Оболонський, Печерський, Подільський, Святошинський, Солом'янський та Шевченківський розташовані на правому березі Дніпра, а Дарницький, Деснянський і Дніпровський - на лівому.",
            "economics_description": "У Києві досить розвинута промисловість. Наявні підприємства таких галузей: харчова, машинобудівна та хімічна фармацевтична.",
            "landmarks": [
                "Золоті ворота",
                "Софіївська площа",
                "Андріїївський узвіз",
                "Маріїнський палац",
                "Володимирська гірка",
                "Міст 'Хвиля Азову'",
                "Будинок із химерами",
                "Києво-Печерська лавра",
                "Червоний корпус КНУ",
                "Михайлівський золотоверхий собор"
            ]
        },
        {
            "id": 2,
            "name": "Харків",
            "region": "Харківська область",
            "year": 1654,
            "population": 1300000.0,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/kharkiv_1.jpg", "name": "Благовіщенський кафедральний собор"}, 
                {"file": "../assets/kharkiv_2.jpg", "name": "Будівля Держпрому"},
                {"file": "../assets/kharkiv_3.jpg", "name": "Сквер Стрілка"},
                {"file": "../assets/kharkiv_5.jpg", "name": "Будівля Харківської міської ради"},
                {"file": "../assets/kharkiv_6.jpg", "name": "Успенський собор"},
                {"file": "../assets/kharkiv_7.jpg", "name": "Будівля Храківського залізничного вокзалу"},
                {"file": "../assets/kharkiv_8.jpg", "name": "Харківський національний університет ім. В.Н. Каразіна"}
            ],
            "short_description": "Ха́рків — місто на північному сході України, на Слобожанщині, науковий центр України, адміністративний центр Харківської області. Перша столиця Радянської України (1919-1934 рр.) Друге за кількістю мешканців місто України з населенням 1 421 125 осіб на 01.01.2022.",
            "history_description": "Харків був заснований у 1654 році як фортеця для стримування набігів кримських татар і ногайців. Місто стає полковим центром Харківського слобідського козацького полку. З 1765 року, у наслідку скасування козачого устрою Слобожанщини, Харків став губернським містом. На початку ХХ століття місто було великим промисловим, культурним, торговим та освітніми Слобідської України в Російській імперії. Після Лютневої революції 1917 року Харковом керували представники різних влад: Українська соціал-демократична робітнича партія, Партія українських соціалістів-революціонерів (есери), більшовики, ЗСПУ та інші. З грудня 1919 року до Харкова повернувся радянський уряд. Місто почало розвиватися у напрямку індустріалізації. Почали будуватися великі заводи, населення збільшувалось за рахунок міграції. Паралельно розвивається наука та культура. \n\n У Харкові вперше в Україні було розпочато радіомовлення. 16 листопада 1924 року о 19:00 в Харкові вийшла в ефір перша радіопередача. З гучномовців пролунало: «Алло, алло, алло! Говорить Харків, говорить Харків, говорить Харків!». На честь початку мовлення Українського радіо 1994 року 16 листопада в Україні проголошено Днем працівників радіо, телебачення та зв'язку В Харкові вперше в СРСР було розщеплене атомне ядро.\n\nПід час Другої світової війни німецька армія вступила до Харкова у жовтні 1941 року. За часи двохрічної окупації населення міста зменшилось більше ніж у 3 рази. За оцінками експертів Харків був одним із найбільш зруйнованих міст Другої світової війни в Європі.\n\nЗа часи радянської влади місто було великим промисловим, науковим, освітнім, транспортним центром України та СРСР. Харків в ті часи був відомий своїми заводами: ХТЗ (Харківський тракторний завод), Турбоатом та заводом ім. Малишева, будівлею Держпрому, найбільшою площею Європи (зараз площа Свободи), зоологічним парком, Харківським національним університетом та іншими. Значну роль в економіці СРСР Харків відіграв у авіаційному, тракторному та військовому машинобудуванні й електроніці. Через Харків проходили транспортні шляхи, які з'єднували центр імперії з півднем, захід з центром. У 1975 році у Харкові було відкрито першу лінію метрополітену.\n\nЗ початку Незалежності України Харків, як й вся країна, опинився у ситуації перебудови економіки. Багато підприємств було закрито або реконструйовано, через зв'язки з ринками країн СНД та залежність від російської нафти, мінералів і газу.\n\nЗ 2006 року місцева рада системно орієнтувала економіку, культуру та інші сфери життя містян на співробітництво з РФ. Протести Євромайдану взимку 2013—2014 років в Харкові були не численні. У березні та квітні 2014 року сили безпеки та контрдемонстранти завадили сепаратистським намірам створення в Харківській області автономії за сценарієм Донбасу. Опитування, які були проведені з вересня по грудень 2014 року, виявили в Харкові незначну кількість містян, які підтримували приєднання до Росії.\n\nЕкономіка Харкова після припинення співробітництва з РФ почала переорієнтовуватися на нові міжнародні ринки, військові підприємства мали збільшення оборонних контрактів, продовжував розвиватися експорт в секторі ІТ-послуг",
            "climate_description": "Харків розташований на схилах Середньоруської височини, в долинах річок Уди (ліва притока Сіверського Дінця), Лопань (ліва притока Уди) та Харків (ліва притока Лопань). Рельєф — яружно-балковий, з високими правими берегами річок. На території міста є штучні озера: водосховища та затоплені кар'єри. В заплавах річок трапляються стариці. Клімат Харкова — помірно-континентальний. Зима прохолодна та сніжна, з декількома відлигами; літо — спекотне, з короткочасними дощовими періодами; весна та осінь — короткі, з заморозками на ґрунті. Середня температура року становить +8,7 °C, середня річна кількість опадів — 520 мм. Харків розташовано в лісостеповій природній зоні. З рослинності домінують породи широколистяних лісів. Природно-заповідний фонд Харкова становлять 15 територій та об'єктів, серед яких 2 загальнодержавних (зоопарк і ботанічний сад ХНУ)",
            "districts_description": "Разом із прилеглими містами й районами утворює Харківську агломерацію з людністю понад 2 млн осіб. Територія Харківської міської територіальної громади поділяється на дев'ять адміністративно-територіальних одиниць — районів: Шевченківський, Новобаварський, Київський, Слобідський, Холодногірський, Салтівський, Індустріальний, Немишлянський і Основ'янський. Найбільшим за площею є Київський район, а найменшим — Немишлянський. З 2020 року місто входить до складу Харківського району",
            "economics_description": "Останній перепис населення 2001 року показав, що в місті мешкало 62,8 % українців. Українська мова є єдиною офіційною мовою міста. За даними опитування, проведеного Міжнародним республіканським інститутом у 2023 року більшість населення міста вдома спілкуються російською мовою.\n\nХарків має розвинуту мережу міського громадського транспорту: тролейбусні, трамвайні, автобусні маршрути та метрополітен (3 гілки з 30 станціями).\n\nЯк культурний та освітній центр Слобожанщини та України, Харків до 24.02.2022 мав 60 науково-дослідних інститутів, 45 вищих навчальних закладів, серед яких ХНУ імені В. Н. Каразіна, який входить до найкращих 500 ВНЗ світу та НТУ «ХПІ», який входить до найкращих 1000, 8 музеїв, міську картинну галерею, 7 державних театрів і кілька десятків недержавних, 80 бібліотек, спортивні об'єкти, виставкові зали та сучасні офісні простори",            
            "landmarks": [
                "Будівля Держпрому",
                "Сквер Стрілка",
                "Благовіщенський кафедральний собор",
                "Успенський собор",
                "Харківський ботанічний сад",
                "Сад імені Тараса Шевченка",
                "Міст закоханих",
                "Саржин Яр",
                "Екопарк 'Фельдман'",
                "Олексіївський лугопарк",
                "Центральний парк"]
        },
        {
            "id": 3,
            "name": "Житомир",
            "region": "Житомирська область",
            "year": 884,
            "population": 261624,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/zhytomyr_1.jpg", "name": "Місцевий парк"}, 
                {"file": "../assets/zhytomyr_2.jpg", "name": "Місцевий парк"},
                {"file": "../assets/zhytomyr_3.jpg", "name": "Собор святої Софії"},
                {"file": "../assets/zhytomyr_4.jpg", "name": "Вид з вантового мосту"},
                {"file": "../assets/zhytomyr_5.jpg", "name": "Свято-Преображенський кафедральний собор"},
                {"file": "../assets/zhytomyr_6.jpg", "name": "Літературно-меморіальний музей В.Г. Короленка"},
                {"file": "../assets/zhytomyr_7.jpg", "name": "Будівля Житомирскої ОДА"},
                {"file": "../assets/zhytomyr_8.jpg", "name": "Житомирський державний університет імені Івана Франка"}
            ],
            "short_description": "Жито́мир — місто на Півночі України, розташоване на річці Тетерів. Адміністративний центр Житомирської області та Житомирського району, центр Житомирської міської об'єднаної територіальної громади. Населення міста — 261,6 тис. осіб (01.01.2022), територія — 6500 га. Житомир є важливим транспортним вузлом: через місто пролягає автошлях М06, який поєднує Київ зі Львовом і Варшавою та Ізмаїлом, а також автошляхи E40, E583, М21.",
            "history_description": "Житомир належить до найдавніших міст України. За місцевою легендою, яку записав історик XIX століття, священник Микола Трипольський, місто започатковано близько 884 року, і свою назву отримало від імені руського дружинника київських князів Аскольда та Діра — Житоми́ра, що нібито відмовився служити Олегу, сховався в лісах і оселився на високій скелі при злитті рік Кам'янки й Тетерева. Згодом над глибоким (близько 30 метрів) урвищем над Кам'янкою збудували дерев'яний замок (зараз на Замковій горі у цьому місці розташований філіал обласного архіву).\n\nВідомий чеський вчений-славіст Павло Йосиф Шафарик доводив, що древнє городище — майбутній Житомир — виникло як центр племені житичів, що входило в племінний союз древлян. Назва міста — мир житичів, як і самого племені, основним заняттям якого було хліборобство, виникла від важливої в цьому краї культури — жита, що культивується тут із незапам'ятних часів. Є свідчення про те, що в давнину навіть у центрі міста сіяли жито, ячмінь. Про місто говорили: «мир і жито», «мир житичів». Можливо також, що Житомир — це скорочена форма від слова «животомир», тобто символ мирного спокійного життя. Відомо також, що чоловіче ім'я Житомир поширене в Хорватії та Сербії. Також назва Житомир, поряд з назвами Київ, Боярка, Радичі зустрічається на території колишньої Югославії.\n\nАрхеологами виявлені поблизу міста поселення і кургани епохи бронзи, ранньої залізної доби. В межах міста розкопано також могильники VII сторіччя та залишки староруського городища Х — XIII століть. У 1878 році київський професор Володимир Антонович почав розкопки в околицях Житомира давньоруського городища Х-XI століть. З 1886 року археологічні розкопки на території міста вів Сергій Гамченко, результатом яких була його монографія «Житомирський могильник».\n\nПерша літописна згадка про Житомир відноситься до 1240 року, у зв'язку з походом на захід війська Батия, після розгрому Києва. Житомир, під час монголо-татарського нашестя, було цілком розорено й зруйновано. До XVII століття місто постраждало від татар ще кілька разів.\n\nУ 1444 році Житомир одержав магдебурзьке право. Місто поступово росло, будувалося, розвивалися ремесла, торгівля. Його центром і найзначнішою спорудою був замок. У 40-х роках XVI століття замок був перебудований і укріплений за проєктом місцевого зодчого Семена Бабинського. Товсті стіни були оточені оборонним ровом, заповненим водою.\n\nПісля Люблінської унії 1569 року Житомир увійшов до складу Речі Посполитої.В 1594–1596 роках спалахнуло народне повстання під керівництвом Северина Наливайка і Григорія Лободи, житомиряни хоробро боролися в селянсько-козацьких загонах.\n\nВизвольна війна українського народу проти польсько-шляхетського панування, яку очолив Богдан Хмельницький, викликала новий підйом народного руху. У 1648 році військо Богдана Хмельницького штурмом узяло житомирський замок. Житомиряни разом з козацькими полками М. Кривоноса під стінами Житомирського замку билися з загоном Я. Вишневецького. Поворотним пунктом в історії міста можна вважати 1667 рік, коли за умовами Андрусівського перемир'я, Київ відійшов до Московського царства, а київські гродський та земський суди було перенесено до Житомира, який фактично став також і адміністративним центром Київського воєводства.\n\nПотрясінням для міста стало велике селянське постання 1768 року відоме під назвою Коліївщина. У селі Кодня, біля Житомира, було страчено біля трьох тисяч учасників повстання.\n\nУ 1795 році, після третього поділу Польщі, Житомир був окупований та анексований Російською імперією, а з 1797 року став центром новоствореної Волинської губернії. Остаточно цей статус було затверджено через сім років, у 1804-му. У 1856 році побудовано Михайлівський собор на кошти житомирського купця Михайла Хаботіна (1861). У 1866—1874 рр. будується Спасо-Преображенський собор. Скасування кріпосного права, розвиток капіталістичних відносин сприяли перетворенню Житомира в промислово-торговий центр.\n\nУ 1896 році була споруджена вузькоколійна залізниця Житомир—Бердичів, а під час Першої світової війни широка колія зв'язала Житомир із Бердичевом і Коростенем.\n\nВ 1917 році місто входить до складу Української Народної Республіки. З проголошенням III Універсалу стає земським центром адміністративно-територіальної одиниці Болохівська земля. Протягом Першої радянсько-української війни опиняється під окупацією, але 22 лютого 1918 року, за результатом бою за Житомир повернувся під контроль УНР: після 3-годинного гарматного обстрілу Житомира, внаслідок якого було придушено артилерію ворога, українські війська здобули його, а ворог відступив на Бердичів. З початком Другої радянсько-української війни, 9 березня радянсько-російські війська перетнули лінію «Коростень — Житомир — Умань — Ольвіополь — Херсон — Мелітополь». Українські війська здійснили вдалий контрнаступ, але 12 квітня місто знову опиняється під окупацією.\n\nУ листопаді 1921 року, під час Листопадового рейду, теренами області пролягав шлях Волинської (командувач — Юрій Тютюнник) та Подільської групи (командувачі: Михайло Палій-Сидорянський та Сергій Чорний) Армії Української Народної Республіки.\n\nВнаслідок поразки Перших визвольних змагань місто надовго окуповане більшовиками.\n\nМісто Житомир у 1932—1933 рр. входило до складу Київської області. За архівними документами, у 1932—1933 рр. загинуло 8015 чол., на сьогодні встановлено імена 7418 чол. та 597 невідомих. В основному голод зачепив довколишні села, але й у самому місті зареєстровані факти голодної смерті, масових хвороб та психозів, викликаних тривалим голодуванням. Крім того, до складу сучасного Житомира увійшли села та хутори, які були повністю або частково знищені голодомором: с. Смоківка, с. Соколова Гора, с. Шляхта, с. Крошня Українська, с. Смолянка Друга, с. Крошня Чеська, с. Нова Крошня, а також хутори Видумка, Киналевського, Хінчанка Друга, Хранівка, Хінчанка Перша, Церковщина, Шевченка (два однойменні хутори), Богунія, Виговського, Стара Рудня. Усі ці населені пункти на сьогодні не існують, а населення, яке пережило геноцид, частково інтегрувалося у міську громаду Житомира.\n\nУ роки Другої світової війни, 22 червня 1941 в перші години наступу німецьких військ на СРСР місто було піддано бомбардуванню гітлерівської авіації. У наступні два-три дні більше трьох тисяч жителів було примусово мобілізовано до лав Червоної Армії.9 липня німці увійшли в Житомир. Війська 5-ї армії під командуванням генерал-майора М. І. Потапова неодноразово переходили в контрнаступ, створюючи погрозу основним силам німецької групи армій «Південь» і затримуючи наступ на Київ.\n\n20 жовтня 1941 р. Житомир став адміністративним центром однойменної генеральної округи. Особливі частини СС і гестапівські служби кидали військовополонених у стаціонарний табір смерті, замаскований під лазарет, де щодня гинуло близько 400 чоловік.\n\nАктивні бойові дії на початку 1942 року вели біля двадцятьох підпільних радянських груп. Пізніше підпільні організації діяли разом із загонами партизанських з'єднань С. Ф. Маликова й О. М. Сабурова. 12 листопада 1943 року частини 23-го стрілецького корпусу і з'єднання 1-го гвардійського кавалерійського корпусу під командуванням генералів М. О. Чувакова і В. К. Баранова захопили Житомир. Але німці не хотіли позбутися важливого вузла комунікацій і, підтягнувши свіжі сили, перейшли у наступ. Після жорстоких боїв радянські війська залишили місто.\n\nВирішальна битва на Житомирському напрямку почалася в грудні 1943 року, коли після 50-хвилинного артилерійського обстрілу і бомбардування з повітря війська 1-го Українського фронту прорвалися крізь ворожу оборону, розширили прорив до 300 км по лінії фронту і 200 км у глибину, захопивши Радомишль, Брусилів, Коростишів.\n\nВпродовж 1957—1990 років у місті побудовані десятки промислових, транспортних, будівельних, інженерних об'єктів. Серед них — льонокомбінат, заводи хімічного волокна, верстатів-автоматів, «Промавтоматика», «Електровимірювач», металоконструкцій, загороджувальних конструкцій, Житомирський м'ясокомбінат, завод лабораторного скла, паперова фабрика (яка випустила перші кілограми паперу в червні 1962 року) тощо. Чисельність зайнятих у промисловому виробництві тільки за 1968—1976 р. зросла вдвічі. У місті з'явилися нові вищі, середні спеціальні, науково-дослідницькі, проєктно-конструкторські організації, розвивалися установи культури, спорту, туризму.\n\nЗ 24 серпня 1991 року Житомир є обласним центром незалежної України. До середини 1990-х років в місті діяв Соколівський гранітний кар'єр, але надалі його було закрито та затоплено. З 1992 Житомир є центом єпархії Української Православної Церкви Київського патріархату, а з 2018 — Помісної Православної Церкви України (кафедральний храм — Михайлівський собор).",
            "climate_description": "Місто перебуває у зоні, котра характеризується помірним континентальним кліматом з теплим літом. Найтепліший місяць — липень із середньою температурою 17.8 °C. Найхолодніший місяць — січень, із середньою температурою -4.4 °С",
            "districts_description": "Місто поділяється на 2 райони: Богунський та Корольовський.",
            "economics_description": "Розвинуті легка, харчова та переробна промисловість.",
            "landmarks": [
                "Підвісний міст через річку Тетерів",
                "Парк Гагаріна",
                "Свято-Михайлівський кафедральний собор",
                "Свято-Преображенський кафедральний собор",
                "Лютеранська Кірха",
                "Собор святої Софії",
                "Ботанічний сад ЖНАЕУ"
            ]
        },
        {
            "id": 4,
            "name": "Львів",
            "region": "Львівська область",
            "year": 1256,
            "population": 717273,
            "oldnames": "-",
            "photos": [
                {"file": "../assets/lviv_1.jpg", "name": "Площа Ринок"}, 
                {"file": "../assets/lviv_2.jpg", "name": "Театр опери та балету"},
                {"file": "../assets/lviv_3.jpg", "name": "Трамвай на центральних вуличках Львова"},
                {"file": "../assets/lviv_4.jpg", "name": "Історичний центр Львова"},
                {"file": "../assets/lviv_5.jpg", "name": "Волоська церква"},
                {"file": "../assets/lviv_6.jpg", "name": "Церква святих Ольги та Єлизавети"},
                {"file": "../assets/lviv_7.jpg", "name": "Палац Потоцьких"},
                {"file": "../assets/lviv_8.jpg", "name": "Львівський національний університет імені Івана Франка"}
            ],
            "short_description": "Львів — місто в Україні, адміністративний центр області, агломерації, району, міської громади, національно-культурний та освітньо-науковий осередок країни, великий промисловий центр і транспортний вузол. Вважається столицею Галичини та центром Західної України. За кількістю населення — п'яте місто країни (717 273 станом на 01.01.2022).\n\nІсторичний центр Львова занесено до списку Світової спадщини ЮНЕСКО. У місті розташована найбільша кількість пам'яток архітектури в Україні. 2009 року Львову надано звання Культурної столиці України.",
            "history_description": "Археологічні розкопки свідчать, що територія сучасного міста була заселена ще у V столітті. Наприкінці X століття ці землі ввійшли до складу Русі, зокрема удільних Галицького, а з 1199 року — Галицько-Волинського князівств.\n\nЗасновником міста  вважають короля Данила, який назвав укріплене поселення на честь свого сина Лева, хоча жодне джерело не дає підстав для такого твердження. Місто розташувалося на межі належних Левові Перемишльського та Белзького князівств. Перша письмова згадка про Львів міститься у Галицько-Волинському літописі і датується 1256 роком, від якого і ведеться міське літочислення. Руський Львів складався з дитинця (Високого замку), королівської резиденції (Низького замку) та укріпленого подолу в районі сучасної площі Старий Ринок. 1272 року син короля Лев I Данилович, який сприяв розвитку міста (зокрема, визначив для новоприбулих три дільниці: на сході — руську, на півночі — для вірмен для татар, на півдні — для юдеїв) переніс столицю Галицько-Волинської держави з Холма до Львова. Тут також, ймовірно, перебував фактичний осідок митрополитів Галицьких, настоятелів окремої митрополії Константинопольського патріархату, що існувала з перервами від 1303 до 1401 року.\n\nПісля смерті галицько-волинського князя Юрія II Болеслава 1340 року волинські бояри проголосили правителем Дмитра-Любарта Гедиміновича. Того ж року король Польщі Казимир ІІІ напав на Львівську і Перемишльську землі; між ним і Любартом почалася «Війна за галицько-волинську спадщину». У цих умовах місцеві бояри під проводом Дмитра Дедька взяли владу до своїх рук, спершу визнаючи зверхність Королівства Польського, а з 1341 року — сюзеренітет Дмитра-Любарта Гедиміновича. 1349 року, після смерті Дмитра Дедька, Казимир ІІІ удруге захопив Львів і спробував приєднати (за іншими даними приєднав) Галичину до Польщі на автономних правах. 1356 року король Казимир ІІІ здійснив повторну локацію міста, перемістивши новий центр на південь від первісного, княжого граду. Поруч із руським подолом запрошені королем будівничі за німецькими зразками звели нове готичне місто-фортецю, поділене на квартали, з Ринком посередині. Більшість його населення становили німці; українці-русини жили переважно в передмістях. Існували самоврядні вірменська і єврейська громади. 1356 року король Казимир ІІІ надав Львову «маґдебурзьке» право самоврядування. З часів Казимира і до початку 15 ст. карбував монети Львівський монетний двір.\n\n1370 року, за договором між Казимиром ІІІ і угорським королем Людовиком, Галичина перейшла під владу угорського монарха, який хотів включити її до складу Королівства Угорського, зустрівши опір польських можновладців. 1387 року донька Людовика, польська королева Ядвіґа Анжуйська, після військового походу захопила ці землі для Польщі.\n\n1379 року Львів, що лежав на важливому відтинку Великого шовкового шляху з Криму до Німеччини, отримав «абсолютне право складу». Воно передбачало, що всі купці, які везли товари через місто, були зобов'язані впродовж двох тижнів виставляти свій крам на продаж у Львові, а вже потім могли їхати далі. Місто стало важливим ремісничим і торговельним центром. Відомими були ярмарки на день св. Аґнеси (21 січня) та св. Маргарити (13 липня), пізніше святоюрські.\n\n1434 року автономія Галичини як Королівства Руського була скасована, а на більшості його земель утворено Руське воєводство з центром у Львові. У XV ст. Львів був Лемберґом: місто мало «німецьке обличчя», німецькою мовою «ґмінна рада» видавала ухвали, велися дискусії, виголошували промови в костелах. Полонізація міста почалася за правління двох останніх Ягеллонів.\n\nЧерез посилення експансії Османської імперії до Європи обсяги торгівлі через Львів значно зменшилися, що спричиняло збідніння міста. Падіння Константинополя сприяло появі в місті багатьох греків. Великим ударом стала пожежа 1527 року, найстрашніша в історії міста, коли готичний Львів вигорів дотла. Для відбудови були запрошені архітектори з Північної Італії, які застосовували ренесансний стиль. Торговельні шляхи занепали, тому відновлення економіки міста було пов'язане з розвитком місцевого виробництва. Основними продуктами експорту стали риба, віск та хутро, зокрема, соболі.\n\nУ другій половині XVI століття у Львові починають діяти Успенське православне братство та школа при ньому, тут веде свою діяльність першодрукар Іван Федорович. Станом на 1630 рік у місті проживало 25—30 тис. мешканців, що робило його найбільшим містом на території сучасної України.\n\nВажливим також був 1661 рік, коли львівська Колегія єзуїтів отримала статус університету.\n\nОднак, починаючи зі середини XVII століття місто переживає спустошливі війни. 1648 — українське козацьке військо Богдана Хмельницького обложило Львів, козаки Максима Кривоноса штурмом взяли Високий Замок, уперше за всю його історію. 1704 року шведські війська під керівництвом короля Карла XII під час Великої Північної війни здобули укріплений центр міста (також уперше в його історії) і пограбували його. Після цього Львів почав хилитися до занепаду.\n\n1772 року внаслідок першого поділу Речі Посполитої Львів відійшов до складу Габсбурзької монархії, ставши столицею коронної провінції — Королівства Галичини і Лодомерії. Австрійська влада впорядкувала міське господарство, у 1777–1820 роках було знесено міські мури, споруджувалися нові квартали у стилі класицизму. Під час австрійського панування в місті активно розвивалася наука і культура: було збудовано два великі театри, реорганізовано Університет і відкрито Політехніку, організовано видавничу справу, запроваджено вуличне освітлення, громадський транспорт, залізничне сполучення. У цей період у Львові було винайдено гас і гасову лампу, запущено першу в світі повітряну кулю на рідкому паливі, споруджено перший в Європі залізобетонний міст.\n\nПід час революції «Весни народів» у Європі 1848 року повстала польська патріотична верхівка. Руське населення також створило власні репрезентативні структури. Урешті, Відень був змушений піти на поступки і надати автономію Королівству Галичини і Лодомерії. З цим починається новий розквіт міста. Львів став центром українського та польського національних визвольних рухів, адже закони в Австро-Угорщині були демократичнішими, ніж у Росії чи Пруссії, у складі яких перебували решта польських та українських земель.\n\nПід час Першої світової війни у 1914–1915 роках Львів був окупований Російською імперією. Тут перебував адміністративний центр Галицько-Буковинського генерал-губернаторства.\n\n10 лютого 1918 р. в місті пройшла велика українська маніфестація на площі Ринок на честь укладення Берестейського мирного договору з УНР; з балкона «Просвіти» учасників привітав Кость Левицький, лунало «Вже воскресла Україна…». 12 лютого 1918 р. в залі «Української бесіди» відбулося зібрання української громадськості, де обговорили ставлення українців Львова до миру з УНР, схвалили: укладення миру між УНР та сусідами; повернення Холмщини, Підляшшя до Української держави; текст телеграми УЦР, Українській Раді Народних Міністрів, Українській Мировій Делегації. Радість українців Львова занепокоїла поляків (професорів, доцентів університету та інших), 14 лютого було підступно побито дружину четаря УСС Стефанію Новаківську. 3 березня 1918 року в місті відбулося «свято державності і миру» (віче) на підтримку дій уряду УНР, на якому були присутні близько 60 000 осіб.\n\nУ ніч на 1 листопада 1918 року у місті відбулося взяття українцями влади — (Листопадовий чин), унаслідок чого 13 листопада 1918 року була офіційно проголошена Західноукраїнська Народна Республіка зі столицею у Львові. Переважання в місті польського населення та бажання поляків відновити кордони Речі Посполитої спричинило Польсько-українську війну, яка завершилася окупацією Галичини і приєднанням до Польщі. Львів став адміністративним центром Львівського воєводства.\n\nЛьвів у складі міжвоєнної Польщі був великим культурним та науковим центром. Місто поповнилося новими районами (Левандівка, Новий Львів, Персенківка, Нове Знесення та ін.). У Львові витворилася автохтонна міська вулична культура (батяри, львівський шансон), з того часу з'явилася традиція називати Львів «маленьким Парижем». Більшість населення становили поляки 64 %; частка євреїв становила близько 25 %, українців — близько 7-9 % населення міста. Проти українців, як і по всій Галичині, проводилася дискримінаційна політика пацифікації, що породила спротив населення і виникнення українських радикальних партій, зокрема Організації українських націоналістів під проводом Євгена Коновальця. У цей період Львів стає центром українського визвольного руху і втримує цей статус до 1990-х років.\n\n1939 року згідно з пактом Молотова — Ріббентропа Львів і Галичина були окуповані Радянським Союзом і ввійшли до складу Української Радянської Соціалістичної Республіки. Місто стало адміністративним центром Львівської області. У червні 1941 року Львів був окупований нацистською Німеччиною і став центром дистрикту Галичина в складі генерал-губернаторства, що було організоване на території колишньої Польщі. Українські націоналісти проголосили 30 червня 1941 року на площі Ринок у Львові Акт відновлення Української держави, проте німецька адміністрація розпочала проти них терор. Німці винищували також польську (Убивство львівських професорів) інтелігенцію, а внаслідок Голокосту загинуло майже все єврейське населення Галичини. 1942 року українські націоналісти створили Українську Повстанську армію, яка почала військові дії проти німців. Від листопада 1943 року нею командував Роман Шухевич. Улітку 1944 року УПА та Армія Крайова намагалися взяти місто під свій контроль, зокрема, на ратуші висів прапор Польщі, однак, 27 липня 1944 року Львів зайняла Червона Армія.\n\nУнаслідок війни Львів упродовж 1946 року покинула більшість поляків, що населяли місто. Відбувся так званий обмін населенням із Польщею. На їхнє місце прибули українці зі Сходу, переселенці з Росії й російськомовні євреї. Проти УПА велася нещадна війна, що супроводжувалася жорстокими репресіями проти місцевого українського населення. 5 березня 1950 року Роман Шухевич загинув на конспіративній квартирі в околицях Львова у Білогорщі.\n\nРадянська влада індустріалізувала Львів, звівши ряд промислових гігантів у місті. Сюди в 1950-х і особливо у 1960-х роках масово переселяються українці з навколишніх сіл. Було збудовано великі спальні райони, як-от Сихів, Рясне, Збоїща, на вулицях Любінській, Науковій, ін. У Львові вкотре змінилося населення. Тепер він став найбільшим україномовним містом (близько 80 % мешканців) і центром національно-визвольного руху, який привів до проголошення незалежності України 24 серпня 1991 року.\n\nУ 1990-х відбувається розвал великих підприємств і триває затяжна економічна криза. Львів зберігає значення як великий культурно-релігійний, освітній і науковий центр, розвивається сфера послуг, зокрема туризм. У місті з 1994 року проводять щорічний Форум видавців. Серед знакових подій початку 2000-х: візит Папи Римського Івана Павла II 2001 року (богослужіння у Львові за його участі зібрало кілька сотень тисяч вірян) та Скнилівська трагедія під час авіашоу 2002 року, яка забрала життя 77 людей.\n\nЛьвів'яни брали активну участь у Помаранчевій революції та Революції гідності. 1 грудня 2013 року на майдані перед пам'ятником Тарасові Шевченку — традиційному місці проведення міських мітингів — у вічі взяло участь понад 50 тисяч осіб. Львів збирав другі за чисельністю мітинги серед усіх міст України (після Києва).\n\nЛьвів став одним із міст-господарів чемпіонату Європи з футболу 2012 року, в рамках підготовки до якого збудовано новий термінал аеропорту та футбольний стадіон.\n\n2016 року запущено трамвай на Сихів, що сполучив найбільший спальний район із центром міста. У 2010-х активно триває будівництво торгово-розважальних і житлових комплексів, старі промислові об'єкти переобладнують у відкриті багатофункціональні простори та офісні центри. Водночас, невирішеною залишається низка інфраструктурних і побутових проблем, наприклад, проблема переробки сміття після закриття Грибовицького сміттєзвалища.",
            "climate_description": "Львівський клімат є помірно континентальним з м'якою зимою і теплим літом. Середньомісячна температура повітря становить −3 °C у січні і +19 °C у липні. Загалом за останні 100—120 років температура повітря у Львові має тенденцію до підвищення. За цей період середньорічна температура підвищилася принаймні на 1 °C. Вологість повітря в середньому за рік становить 79 %. Найчастіше дмуть західні вітри, найрідше — північно-східні. Львів характеризується найбільшою кількістю опадів і найнижчими літніми температурами серед усіх обласних центрів України, що спричинено чи не найменшою континентальністю місцевого клімату з-поміж великих міст України. У середньому за рік випадає 767 мм атмосферних опадів: найменше — в січні, найбільше — в липні. За рік у місті в середньому 174 дні з опадами. Через це місто часто називають «приреченим на дощ». Тема львівського дощу є популярною в місцевих художників, поетів і музикантів. Для всіх пір року характерні різкі перепади атмосферного тиску, температур і вологості повітря. Зими м'які — морози нижче −20 °C спостерігаються вкрай рідко. Стійкий сніговий покрив встановлюється не кожної зими. Весна прохолодна та дощова, заморозки і снігопади можливі до початку травня. Літо прохолодне. Звичайні літні полуденні температури в межах +20-25 °C, спека вище +30 °C спостерігається рідко. Влітку частими є грозові зливи і різкі перепади температур при проходженні атмосферних фронтів. При цьому майже щороку спостерігаються ураганні вітри, які призводять до повалення дерев, обриву ліній електропередач, невеликих руйнувань. Осінь помірно тепла і суха. Мікроклімат центральної частини міста, яка розташована в улоговині, характеризується нижчими мінімальними та вищими максимальними температурами. Для підвищених околиць характерні сильні вітри.",
            "districts_description": "Адміністративно Львів поділяється на 6 районів: центральна частина належить до Галицького району, західна — до Залізничного, північна — до Шевченківського, східна — до Личаківського, південно-східна — до Сихівського, а південна — до Франківського. Разом з цим, у вжитку збереглися давні назви частин міста та сільських місцевостей, які увійшли з часом до складу міста, як-то Левандівка, Білогорща, Збоїща, Рясне, Майорівка, Вулька, Новий Львів, Снопків, Боднарівка, Пирогівка, Козельники, Сихів та інші. Деякі з них відображені сьогодні у назвах вулиць. У підпорядкуванні Львівської міської ради також перебувають місто Винники і селища міського типу Брюховичі та Рудне.",
            "economics_description": "У місті розвинуті такі галузі промисловості: хімічна фармацевтична, машинобудівна. В сфері послуг провідне місце займає туризм - Львів популярний не лише серед українців, а і відвідувачів з інших країн.",
            "landmarks": [
                "Театр опери та балету",
                "Стрийський парк",
                "Площа Ринок",
                "Палац Потоцьких",
                "Італійський двір",
                "Високий замок",
                "Пам'ятник королю Данилу",
                "Парк імені Івана Франка",
                "Вірменський собор",
                "Криївка"
            ]
        },
        {
            "id": 5,
            "name": "Ужгород",
            "region": "Закарпатська область",
            "year": 1200,
            "population": 115449,
            "oldnames": "Унгвар",
            "photos": [
                {"file": "../assets/uzhgorod_1.jpg", "name": "Набережна річки Уж"}, 
                {"file": "../assets/uzhgorod_2.jpg", "name": "Набережна річки Уж"},
                {"file": "../assets/uzhgorod_3.jpg", "name": "Ужгородський кафедральний собор"},
                {"file": "../assets/uzhgorod_4.jpg", "name": "Сакури в Ужгороді"},
                {"file": "../assets/uzhgorod_5.jpg", "name": "Центр міста"},
                {"file": "../assets/uzhgorod_6.jpg", "name": "Міст через річку Уж"},
                {"file": "../assets/uzhgorod_7.jpg", "name": "Центральні вулиці Ужгорода"},
                {"file": "../assets/uzhgorod_8.jpg", "name": "Ужгородський замок"}
            ],
            "short_description": "У́жгород — місто на заході України, обласний центр Закарпатської області, центр Ужгородської міської громади, Ужгородського району та Ужгородської агломерації. Розташоване на річці Уж біля підніжжя Українських Карпат, за 811 км від Києва, на кордоні зі Словаччиною.\n\nЄ найменшим обласним центром України, проте має багату й давню історію. Засноване у IX столітті. Місто тимчасово перебувало під владою Угорщини, а згодом — Австро-Угорщини. Було тривалий час фортецею роду Другетів. Ужгород розвивався як промисловий та культурний центр Закарпаття. У 1919 році був столицею Підкарпатської Русі у складі Чехословаччини, за результатами першого Віденського арбітражу 1938 року став частиною Хортистської Угорщини, у 1945 році увійшов до складу УРСР, з 1991 року — у складі Незалежної України. Серед найвідоміших місць Ужгорода є його замок, туристів також приваблюють костел, синагога та резиденція єпископа. У 1646 році під егідою Ватикану проголошено Ужгородську унію та утворено греко-католицьку церкву на Закарпатті.",
            "history_description": "На території Ужгорода виявлено залишки поселень, найдавніші з яких налічують понад сто тисяч років. Упродовж давніх віків через територію сучасного міста пройшло чимало племен і народів: гуни, авари, бургунди, даки, кельти, сармати. Одними з перших відомих засновників ужгородського поселення були білі хорвати, які у другій половині 1-го тисячоліття заселили територію сучасного Ужгорода. Поселення називалося Онґвар (або Унґвар, чи Гунґвар, чи Унґювар). Протягом століть історично склалися три центри міста: Горяни, Замкова гора та Радванка.\n\nУ IX столітті більш укріплене городище-замок на Замковій горі перетворилося у ранньофеодальне місто-поселення, яке стало центром новоутвореного слов'янського князівства очолюваного князем Лаборцем. На заході князівство Лаборця межувало з Великоморавським князівством, а на півдні — з Першим Болгарським царством. Можливо, що Ужгородське городище в якийсь час входило до їх складу. У 894 році угорські племена під керівництвом сакрального вождя Алмоша та військового вождя Арпад, а протягом чотирьох днів штурмували фортецю міста, у якій оборонявся князь Лаборець зі своїми воїнами. Але сили були нерівними, і князь та його військо були перебиті. Саме городище було спалено, та через деякий час знову відбудовано вже новими господарями. Після приходу угорців навколо замку починає розбудовуватися і розширюватися містечко. У 1086 році Ужгород був атакований половцями хана Кутеска, та взяти його вони не змогли.\n\nУ 1241—1242 роках татаро-монгольські племена під керівництвом хана Батия спалили місто. Нове місто (Унгуйвар) — Новий Ужгород за наказом угорського короля Бели IV, 1248 року будують на новому місці, у сучасному мікрорайоні Горяни. Тут також збудували нову фортецю і поруч із нею церкву (Горянська ротонда).\n\n1290 року новим господарем міста стає канцлер Угорського королівства — Омодей Аба. Під час феодальних міжусобних війн на початку XIV століття, значних руйнувань зазнав і Ужгород. У 1312 році новим господарем міста-фортеці став Петро Пете, який вже 1315 року піднімає повстання проти короля, яке за два роки було придушене.\n\nУ 1318 році місто отримало нових господарів — італійських графів Другетів, які володіли ним протягом 360 років. Філіпп Другет будує нову кам'яну фортецю на місці сучасного замку.\n\nРазом із замком розбудовувалось і місто. У 1384 році завершилося будівництво нового замку, а також відкрито першу в місті школу. Уже 1430 року Ужгород отримує привілеї від короля й офіційно пишеться як «Привілейоване місто Ужгород».\n\nУ 1514 році під час великого повстання під проводом Дєрдя Дожі місто було повністю зруйновано.\n\nПісля поразки угорців у битві з турками у 1526 році біля Могача Угорське королівство було розділено на три частини одна з яких Трансильванське князівство, друга — центральна Угорщина під владою турків, третя західна та північна Угорщина під владою австрійських Габсбургів. Місто Ужгород на тривалий час стає ареною міжусобних боїв. Так, 1538 року Ужгород відійшов до Трансильванії, а вже 1540 року його захопили австрійські війська. У 1564 році місто знову було атаковано трансильванськими військами.\n\nНові господарі графи Другети зміцнили роль міста, як економічного та торговельного центру. У цей час відбуваються перебудова замку та будівництво нових церков. Збереглася з того часу і печатка з написом «Печатка міста Ужгорода. 1675 рік», на якій зображено герб міста: щит із двома виноградними лозами, а на них три листки і два ґрона винограду, що вказувало на основне заняття його мешканців. Цей герб існував майже без змін до 1918 року. (мінялася лише барва щитового тла — у XVII—XVIII століттях щит герба був блакитним, у XIX столітті — червоним; на початку XX століття було відновлено давніший варіант із блакитним щитом).\n\nУ 1631 році у місті було 10 вулиць, 206 кріпосницьких дворів, 32 дворянські маєтки; а загальна кількість жителів — 1200 осіб. Протягом XVI—XVII століть в Ужгороді існувало багато ремісничих цехів: шевський, гончарний, столярний, бондарний. У цей період місто було втягнуто в релігійну боротьбу між реформатською Трансильванією і католицькою Австрією. У 1610 році в місті домінувала католицька церква. У 1619 році Ужгород знову захоплюють протестантські війська Трансильванії. Після десятилітнього правління реформатської влади в місто повернулися католики на чолі з графом Другетом. Саме у 1646 році в Ужгородському замку було зібрано 63 православних священиків і під егідою Ватикану проголошено Ужгородську унію та утворено греко-католицьку церкву на Закарпатті.\n\nУ листопаді — грудні 1648 року, під час Національно-визвольної війни, козаки Богдана Хмельницького здійснили рейд через Карпати за межі Речі Посполитої — в українське Закарпаття, що було під контролем Трансильванії, де були на деякий час взяті околиці Ужгорода.\n\nУ 1707 році Ужгород був резиденцією керівника національно-визвольної війни угорського народу Ференца II Ракоці. Узагалі, Ужгород XVIII століття славився своїми ярмарками. Сюди приїжджали купці зі Словаччини, Німеччини, Угорщини, Молдови, Польщі, Греції, Росії. У цей час було збудовано цілу низку винних підвалів і складів у районі Замкової та Дайбовецької гір. Наприкінці XVIII століття починає розбудовуватися і лівобережна частина міста, де селилися бідняки.\n\nА ось для початку XIX століття характерний економічний розмах. На Закарпатті почав розвиватися капіталізм, хоча і в рамках феодалізму, з'явилися перші фабрики, внаслідок чого площа міста значно збільшилась. У 1837 році в Ужгороді налічувалося 36 вулиць.\n\nНайбільший вплив на Ужгород із політичних подій XIX століття справила Угорська революція 1848—1849 років. 27 березня 1848 року в місті офіційно було відзначено повалення монархії в Угорщині. Для придушення революції Габсбурзький абсолютизм покликав на допомогу армію царської Росії. Не в силах протистояти їм, визвольна війна зазнала поразки. Монархія була знову відновлена. 1849 року Ужгород став центром Руського округу, нового територіального утворення в Австрійській імперії, але вже 1850 року воно було ліквідовано. У 1863 році в Ужгороді була відкрита перша друкарня з українським шрифтом, У 1869 році діяв перший на Закарпатті лісопильний завод, 28 серпня 1872 року почала працювати ділянка Ужгород — Чоп Угорської Північно-Східної залізниці. 1886 року побудована меблева фабрика «Мундус», 1897 року з'явився перший телеграфний зв'язок Ужгород — Будапешт, у 1902 році було введено в експлуатацію першу Ужгородську електростанцію.\n\n9 жовтня 1918 року після віча в Ужгороді створено Руську Народну Раду (РНРада), яка мала боротися за автономію для русинів Угорської Русі. Подібну РНРаду створено 8 листопада на вічі у Старій Любовні (Пряшівщина). Вона вже вимагала виходу зі складу Угорщини та об'єднання з Україною. На противагу українському державницькому рухові, на Закарпатті діяли мадяронський (прихильники Угорщини) та москвофільський рухи.\n\n18 жовтня 1918 року Українська Національна Рада Західноукраїнської Народної Республіки проголосила про утворення Української держави на українській етнічній території Австро-Угорщини, до якої мала б увійти також «українська полоса північно-східної Угорщини» — Закарпаття та Пряшівщина. 13 листопада Українська Національна Рада проголосила у Львові утворення Західно-Української Народної Республіки (ЗУНР). Було затверджено «Тимчасовий основний закон про державну самостійність українських земель бувшої австро-угорської монархії», у якому зокрема йшлося про приналежність до ЗУНР українських частин угорських комітатів Спиш, Шарош, Земплин, Унґ, Берег, Угоча та Мараморош.\n\nПолітична ситуація в Закарпатті ускладнювалася втручанням інших держав у його внутрішні справи. За згодою Антанти, 12 січня 1919 року чехословацькі військові частини зайняли Ужгород, далі територію краю на захід від річки Уж. Східні регіони Закарпаття почали окуповувати румунські війська. За Сен-Жерменським мирним договором 1919 року Закарпаття під назвою Підкарпатська Русь увійшло до складу Чехословаччини.\n\nПерша світова війна сповільнила темп розвитку міста. 12 січня 1919 року полк чехословацьких легіонерів зайняв правобережну частину міста, лівобережна ж залишилася під владою Угорщини. А 10 вересня 1919 року Закарпаття офіційно увійшло до складу Чехословацької республіки, а Ужгород став адміністративним центром автономного округу. У 1930 році Чехословацька влада висушила болота на Ужі і у квітні 1930 року розпочала будівництво міського водогону фірмою Ing. Jaroslav Maticka (Прага, Карлін). Підприємство Матічки будувало безпосередньо мережу водогону, помпові станції та встановлювало пожежні гідранти. Будівництво водозабору, водонапірних резервуарів і вхідної будівлі водогону здійснювала фірма Ing. Vaclav J. Vojacek з Моравської Острави. Кошторис будівництва водогону становив 8 мільйонів чеських крон. Саме в часи Чехословацької республіки місто отримало сучасну архітектурну довершеність. На висушеній території зведений урядово-житловий квартал Малий Галагов. Квартал розташовано впритул до старого центру міста. Однак вже від 2 листопада 1938 року за Віденським арбітражем Ужгород передано Угорщині.\n\nУ 1941 році Угорська держава, до складу якої входило і Закарпаття, вступила у Другу світову війну. До кінця 1944 року бої підійшли до Ужгорода. Війна не принесла місту якихось істотних руйнувань, хоча призвела до значних змін у населенні міста. У боях за місто брали участь частини 4-го Українського фронту, які 27 жовтня 1944 року оволоділи Ужгородом.\n\nУ 1941 році єврейське населення нараховувало 9576 осіб. 19 березня 1944 року в місто увійшли німецькі війська. Вони заснували юденрат (Єврейська рада) і створили 2 гетто, на цегляному заводі Московіц і на лісопилці Глюк. У травні 1944 року всі євреї були депортовані в Освенцим на 5 різних видах транспорту, згодом вбиті. Вижило лише кілька сотень євреїв.\n\nДата офіційного передання зі складу ЧСР до складу СРСР — 26 червня 1945 року. Новий період приніс у життя краю значні зміни. Зокрема, радянська влада розцінювала край як надважливий військовий плацдарм у центрі Європи за Карпатськими горами, одразу з чотирма державними кордонами (Польща, Чехословаччина, Угорщина, Румунія).\n\nЗагалом на території області на 1990 рік було зосереджено до 200 тисяч військовослужбовців (дані від офіцера зв'язку КДБ СРСР), це, враховуючи, що цивільне населення Закарпаття тоді офіційно нараховувало близько 1 250 000 осіб, було 1/7 всіх людей краю. Враховуючи близькість обласного центру — Ужгороду від держкордону (в деяких місцях міські будинки розміщувалися всього в 200 метрах від чехословацького кордону), його з одного боку перетворили на закрите місто, а з другого вирішили перетворити на показову вітрину «радянського способу життя».\n\nДля цього місто зазнало індустріалізації. Потреба в спеціалістах на новостворених і перероблених підприємствах створила ще одну проблему — проблему житла. Тому нові житлові райони робилися з розмахом і змінили обличчя міста. Це були класичні для СРСР 1960—1980-х років багатоповерхові панельні будинки, так звані «хрущовки» і «брежнєвкі». Саме вони сформували ту частину міста, яка займає близько 70 % його території й де проживає до 80 % його населення. Сьогодні ця частина міста відома під загальною назвою «Новий район». Також за радянських часів було відкрито Ужгородський державний університет, сучасний УжНУ.\n\nУ 1991 році Ужгород стає частиною незалежної України.",
            "climate_description": "Клімат помірно-континентальний, з жарким літом і м'якою зимою. Значно впливає на клімат міста захищеність Карпатами від холодних вітрів з півночі. За кліматичною класифікацією Кеппена — Гейгера клімат Ужгорода є морським. Найнижча середньомісячна температура повітря в січні (мінус 11,1 °C) зафіксована у 1964 році, найвища (4,1 °C) — у 1936 році. Найнижча середньомісячна температура в липні (17,6 °C) спостерігалась у 1902 і 1979 рр., найвища (23,6 °C) — у 1994 році. Абсолютний мінімум температури повітря (-32,0 °C) зафіксовано 9—10 лютого 1929 року, абсолютний максимум (38,6 °C) — 15 липня 1952 року.\n\nУ середньому за рік в Ужгороді випадає 730 мм атмосферних опадів, найменше їх у березні та квітні, найбільше — у травні та липні.\n\nВідносна вологість повітря в середньому становить 72 %, найменша вона у квітні (62 %), найбільша — у грудні (83 %).",
            "districts_description": "Особливістю Ужгорода є відсутність його поділу на адмінстративні райони.",
            "economics_description": "Ужгород є найважливішим економічним центром Закарпаття, тут знаходиться понад 5 тис. суб'єктів господарської діяльності, з них 90 % — приватної або колективної власності. Основними галузями промисловості є харчова, легка, деревообробна, меблева, виробництво машин та устаткування.\n\nВ Ужгороді проживають українці, росіяни, угорці та словаки.",
            "landmarks": [
                "Набережна річки Уж",
                "Ужгородський каедральний собор",
                "Міст через річку Уж",
                "Ужгородський замок"
            ]
        },
        {
            "id": 6,
            "name": "Одеса",
            "region": "Одеська область",
            "year": 1415,
            "population": 1010537,
            "oldnames": "Хаджибей, Адес, Коцюбіїв, Істріан",
            "photos": [
                {"file": "../assets/odessa_1.jpg", "name": "Театр опери та балету"}, 
                {"file": "../assets/odessa_2.jpg", "name": "Вулицями Одеси"},
                {"file": "../assets/odessa_3.jpg", "name": "Морське узбережжя"},
                {"file": "../assets/odessa_4.jpg", "name": "Міський сад"},
                {"file": "../assets/odessa_5.jpg", "name": "Потьомкінські сходи"},
                {"file": "../assets/odessa_6.jpg", "name": "Прибутковий будинок Лерхе"},
                {"file": "../assets/odessa_7.jpg", "name": "Приморський бульвар"},
                {"file": "../assets/odessa_8.jpg", "name": "Воронцовський маяк"}
            ],
            "short_description": "Оде́са — місто в Україні. Адміністративний центр Одеської області та відповідного району. Третє за кількістю мешканців місто країни після Києва та Харкова (станом на 01.01.2022). Розташоване на узбережжі Чорного моря. Найбільший морський торговий порт держави. Культурно-освітній, туристичний, торговий, транспортний центр. Складова Одеської міської територіальної громади. Населення — 1 010 537 осіб (2022).",
            "history_description": "Перші ознаки людей на території сучасної Одеси та її околиць стосуються епохи верхнього палеоліту (58 — 38 століття до нашої ери). У V столітті до н.е. на місці сучасного центру Одеси існувало стародавнє грецьке поселення — «Гавань Істріан». Залишки цієї колонії були знайдені під сучасним Приморським бульваром на глибині 1,5 м, а також на інших вулицях міста. Окрім цього поселення, на території Одеси також налічується близько дванадцяти інших давньогрецьких колоній. Крім інших, на протилежному березі Одеської затоки було поселення «Гавань Ісіякон». Суперництво між мешканцями цих колоній було зумовлене тим, що між ними проходив кордон грецьких міст-колоній Ольвії (на північному сході зі сторони гавані Ісіякон) та Істрії (на півдні зі сторони гавані Істріан). У другій половині IV — початку III століття до н. е. Ольвія вступила в конфлікт із сусідніми грецькими колоніями, Херсонесом та Істрією. Причиною війни стало невдоволення правителями Ольвії сферами впливу в цьому регіоні. На той час гавань Істріан була прикордонним форпостом Істрії, тому через війну це поселення прийшло у запустіння наприкінці IV століття до н. е., а гавань Ісіякон проіснувала ще два століття. Занепад грецьких колоній також був зумовлений вторгненням союзу кочових племен гунів у 375 році нашої ери. Прихід кочовиків на ці землі повністю розорив місцеве населення та перетворив ці землі у Дике Поле, де населення практично не було.\n\nБлизько VІІ століття тут оселилися Тиверці — слов'янське плем'я, що жило у лісостеповій зоні між Дністром, Прутом і Дунаєм, на територіях біля Чорного моря. Тиверці і уличі, як вважають сучасні дослідники, були нащадками антів і входили до Антського союзу. Близько VІІ століття тут оселилися Уличі — східнослов'янське плем'я південно-західної групи, що заселяло у VI—IX ст. пониззя Дніпра від р. Росі до Чорного моря у межах розселення антів, нащадками яких вони (як і тиверці) були. Входили до Антського союзу.\n\nБлизько XIV століття, у місцевому степу панувала Ногайська орда, яка згодом влилася до Золотої Орди. В ординські часи, у XIV столітті, на місті колишньої грецької колонії з'явилася генуезька факторія «Джинестра», що торгувала з кочовиками. Генуезці купували у Північному Причорномор'ї здебільшого зерно та рабів. Водночас, на думку науковців, Куяльницький та Хаджибейський лимани почали віддалятися від Чорного моря, у результаті чого утворився природний насип — «Пересип». Це не могло не позначитися на економічному стані краю, позаяк, у наступні роки на цих двох лиманах видобувалося багато солі. На початку 1320-х років одним з основних ворогів Золотої Орди стало Велике князівство Литовське. У 1324 році до литовського панування відійшли всі землі між Дніпром та Дністром, зокрема й територія сучасного міста.\n\nПри правлінні Вітовта було засновано фортецю Коцюбіїв і торгову пристань біля неї. Перша писемна згадка про це поселення датується 1415 роком.\n\n1442 року фортеця була надана польським шляхтичам Бучацьким — тодішнім власникам коронного Поділля. Наприкінці XV століття литовсько-польська влада на цих землях послабилася і вони знову прийшли у запустіння.\n\n1484 року ці землі завоювала Османська імперія, а місцеве населення складали переважно татари. У 1765 році османська влада відбудувала стару литовську фортецю, назвавши її «Єні-Дюнья» (в перекладі з османської — «Новий Світ»). Вона знаходилась між сучасними Потьомкінськими сходами та Воронцовським палацом на Приморському бульварі. Цю фортецю неодноразово штурмували запорізькі козаки під проводом Семена Галицького, Петра Калнишевського тощо. 1774 року фортеця була вперше захоплена об'єднаними козацько-російськими військами. Однак, за Кючюк-Кайнарджійським мирним договором її було віддано туркам.\n\nПід час Російсько-турецької війни 1787—1792 років фортеця потрапила до уваги військ Олександра Суворова, який прямував на Бендери. Її було взято на світанку між 4 та 5 годиною 14 (25) вересня 1789 року передовим загоном корпусу генерала Івана Гудовича. Загоном командував граф Хосе де Рібас. Активну участь у битві за Хаджибей брало Чорноморське козацьке військо на чолі з отаманами Захарієм Чепігою та Антоном Головатим.\n\n7 червня (27 травня) 1794 року російська імператриця Катерина II підписала рескрипт про влаштування у Хаджибеї військової гавані та купецької пристані. Призначенням нового порту на Чорному морі було розширення торгових зв'язків з Європою. Проєкт розбудови міста було доручено нідерландському військовому інженерові, Францу де Воллану. Будівництво портових споруд та головного собору розпочалося 2 вересня (22 серпня) 1794 року під керівництвом Хосе де Рібаса. Цей день і досі відзначається в Одесі, як день міста. Нова назва Хаджибея — Одеса, вперше з'явилася у документі, датованому 21 (10) січня 1795 року. Уже з перших років заснування місто стало основним портом, через який постачалося зерно з Російської імперії до інших країн Європи та Передньої Азії. Багато у чому цьому сприяв прихід на посаду генерал-губернатора Новоросії та градоначальника Одеси Армана Емманюеля дю Плессі (герцога де Рішельє). За час його перебування на цих посадах населення припортового міста виросло у п'ятнадцять разів. Також з 1806 до 1860 роки на теренах сучасного міста та області розташовувалася Усть-Дунайське буджацьке козацьке військо. Внутрішній устрій якого нагадував устрій Запорозької Січі. Центральним органом управління був Кіш, який очолював кошовий отаман. Було запроваджено колишні старшинські посади та була відновлена Генеральна старшина. Військо поділялося на курені, на чолі яких стояли курінні отамани. Під час управління містом герцогом, тут з'явився перший комерційний банк, біржа, іноземні консульства тощо. За часів управління Луї де Ланжерона, у 1819 році, Одеському порту було дано режим порто-франко, що дозволяло право безмитного ввезення та вивозу товарів. Це дозволило розвинути зовнішню торгівлю та покращити економічні умови в місті. Водночас князь Михайло Воронцов, що у той час обіймав посаду генерал-губернатора Новоросії та Бессарабії, зумів привернути до міста увагу багатьох аристократів та багатіїв з усієї імперії, завдяки чому місто стало одним з найбільших промислових центрів країни. У 1820 році вийшла перша міська газета, у 1825 році відкрився археологічний музей. Також у ті часи відкрилося багато закладів освіти й прилюдна бібліотека.\n\n1830 року засновано міську публічну бібліотеку (з 1941 р. — Одеська державна наукова бібліотека ім. М. Горького). На той час зібрання нараховувало 5 тисяч книг, це була друга в Російській імперії (після імператорської у Санкт-Петербурзі) і перша в Україні публічна бібліотека. З 1907-го по сьогодні бібліотека міститься в будинку, який в 1904—1906 роках було зведено за проєктом архітектора Ф. П. Нестурха. В бібліотеці працювало багато визначних особистостей, які в різний час очолювали її. Це історик М. Н. Мурзакевич, професор В. О. Яковлев, літератор М. Ф. Дерібас та його син, краєзнавець О. М. Дерібас, автор книги «Стара Одеса». Особливо важливу роль у розвитку бібліотеки відіграли її директор з 1896 по 1920 рік професор Новоросійського університету М. Г. Попруженко, який створив історичний нарис «Одеська міська публічна бібліотека. 1830—1910», та куратор бібліотеки у 1897—1917 роках почесний громадянин Одеси граф М. М. Толстой. Унікальний фонд найдавнішої книгозбірні України нині нараховує близько 5 мільйонів видань майже 100 мовами світу. Завдяки наявності значної кількості рідкісних документів, матеріалів (понад 200 тис.) та рукописів бібліотека увійшла до світового каталогу «Музей книги й книжної справи» (Museums of Book and Book-making. International Directori. — М., 1987). 1865 року в Одесі на базі Рішельєвського ліцею (першим директором якого був закарпатець Іван Орлай) створено Новоросійський університет (з 1945 р. — Одеський університет ім. І. Мечникова) у складі трьох факультетів: історико-філологічного, фізико-математичного та юридичного, який тривалий час був єдиним вишем на півдні України. Ініціатива у відкритті університету належить М. І. Пирогову.\n\nУ другій половині XIX століття найбільш видатними керівниками міста стали: граф Пауль Деметріус Коцебу, Григорій Маразлі та Микола Новосельський. При керівництві графа Коцебу, проїжджа частина центру Одеси була заміщена бруківкою, замість каганців з'явилися гасові лампи, був побудований перший у місті водогін, відкрита перша залізнична лінія тощо. Також Пауль Деметріус багато уваги приділяв розвиткові освіти та науки. За часів його головування, Рішельєвський ліцей перетворився на Новоросійський університет, а також було засновано багацько шкіл та училищ. На відміну від Коцебу, Григорій Маразлі більше приділяв уваги зовнішньому вигляду міста. Саме тому у часи керівництва грецького міського голови містом, було побудовано Олександрівський парк, пам'ятник-колону Олександру II, відкрито першу конку, введено електричне освітлення, а також побудовано дитячу та очну лікарні, кілька богоділень, дешевих їдалень, притулків, народних училищ у місті та передмісті. До 100-ї річниці свого заснування, 1894 року, Одеса посідала четверте місце в імперії за кількістю населення та рівнем економічного розвитку після Санкт-Петербургу, Москви та Варшави.\n\nУ день початку Першої світової війни 19 липня (1 серпня) 1914 року в Одесі відбулася багатотисячна патріотична маніфестація, що зібралася на Соборній площі і пройшла центральними вулицями міста. У жовтні 1917 року Одеса увійшла до Української Народної Республіки в складі адміністративно-територіальної одиниці Одеса, але її політично-правовий статус в Українській державі був дискусійним. Після проголошення УНР, 30 листопада (12 грудня) — 1 грудня (13 грудня) 1917 року в Одесі спалахнуло більшовицьке повстання, яке закінчилося перемогою українських військ. У січні 1918 року у місті владу зайняли більшовики, створивши 7 (20) лютого 1918 Одеську Радянську Республіку, однак, вона була ліквідована вже 13 березня того ж року після приходу до міста австро-німецьких військ. Після прибуття військ з міста почалися вивозитися продукти та устаткування. Щоправда, після початку німецької революції війська були вимушені покинути Одесу. Незабаром у місті висадилися 30-ти тисячні британсько-французькі війська підтримати прибуваючу з Єкатеринограду 10-ти тисячну «Добровольчу армію» Антона Денікіна. Того ж року у грудні до Одеси підійшла армія української Директорії. Таким чином у різних частина міста налічувалося три різні влади: Антанта, «Білі» та Директорія УНР.\n\nНа початку наступного року, за допомогою партизанів та розповсюдження у іноземних військах більшовицької пропаганди, місто зайняли «Червоні», що майже відразу націоналізували усі міські банки, однак це не допомогло подолати масовий голод та безробіття. За допомогою військ Антанти, що залишилися на рейді ескадри, військам Денікіна вдалося знову встановити свою владу у місті. Однак остаточно радянська влада була встановлена в Одесі з 7 лютого 1920 року.\n\n  перші роки після багатьох воєнних протистоянь, що відбувалися в Одесі, місто опинилося у занепаді. Багато у чому цьому сприяла політика влади, через що інтелігенція міста масово почала виїжджати за кордон. Перші роки під радянською владою позначилися відкриттям низки культурних, освітніх та наукових закладів. У кінці 1930-х рр. під Одесою відбулися масові розстріли людей, заарештованих НКВС.\n\nПід час Другої світової війни Одеса опинилася біля фронту. Оборона міста тривала 73 дні, з 5 серпня до 16 жовтня 1941 року. Увесь цей час місто піддавалося бомбардуванням по 12-15 разів на день. Евакуацію міста було проведено невдало, частина радянських військ не знала про відступ і була захоплена у полон. 15-16 жовтня групи НКВС підірвали велику кількість будівель, у тому числі плотину, що спричинило затоплення району Пересип та загибель цивільного населення. 16 жовтня румунські війська увійшли до міста. Згодом, радянська влада випустила спеціальну нагороду — медаль «За оборону Одеси», а Одесі дала звання «міста-героя». Захопивши місто, румунські війська проводили політику терору, так у жовтні 1941 року в районі артскладів на Люстдорфській дорозі було живцем спалено близько 25 тисяч одеситів, більшість з яких були євреями, також серед загиблих були військовополонені, комуністи, особи, які видалися окупантам підозрілими. У подальшому єврейське населення було майже знищено або виселено з міста у гетто та концтабори. У місті діяв рух спротиву. Радянські партизани були не єдиними підпільниками в окупованій Одесі. Наприкінці 1941 року в місто прибула Південна «похідна група» Організації українських націоналістів. Через три з половиною роки радянські війська третього Українського фронту, під командуванням уродженця Одеси, Малиновського, 10 квітня 1944 року визволили місто у ході Одеської наступальної операції.\n\nВпродовж наступних років у місті проводилася робота по відновленню зруйнованих у часи війни споруд. До 1948 року в Одесі було відбудовано усі найважливіші портові та промислові споруди. Станом на 1975 рік, житловий фонд міста склав рекордну кількість квадратних метрів — 12 мільйонів, що у два рази більше ніж 1940 року. Також у той час виникли нові міські райони: Південний, Південно-Західний, Північно-Східний та Таїровський.\n\nУ 1991 році, 1 грудня, відбувся Всеукраїнський референдум, щодо проголошення незалежності України. За результатами референдуму по усій Одеській області з 1 412 228 опитаних (75,01 %) за проголошення незалежності проголосували — 1 205 755 (85,38 %), проти — 163 831 (11,6 %), а також 42 642 бюлетені стали недійсні. Багато промислових підприємств з проголошенням Україною незалежності були вимушені закритися, інші працюють лише на частину своїх потужностей. Виною тому розрив економічних зв'язків з колишніми радянськими республіками СРСР, недостатня підтримки з боку влади, а також невміння працювати в нових економічних умовах.",
            "climate_description": "Клімат Одеси помірно-континентальний з рисами субтропічного, з м'якою зимою, відносно затяжною весною, теплим і довгим, нерідко дуже спекотним, літом, а також довгою та теплою осінню. За класифікації Кеппена — вологий континентальний, близький до субтропічного. Середньорічна температура повітря становить +13,0 °C, найнижча вона у січні (0,7 °C), найвища — в липні (+24,4 °C). В середньому за рік ув Одесі випадає 592 мм атмосферних опадів, найменше — у жовтні, найбільше — в липні. Мінімальна річна кількість опадів (196 мм) спостерігалась у 1921 році, максимальна (765 мм) — у 2004 році. Максимальну добову кількість опадів (103 мм) зафіксовано 8 червня 1926 року. У середньому за рік у місті спостерігається 112 днів з опадами; найменше їх (6) у вересні, найбільше (14) — у грудні. Відносна вологість повітря становить в середньому 76 %, найменша вона в серпні (66 %), найбільша — у грудні (84 %). Найменша хмарність спостерігається в серпні, найбільша — у грудні. Найбільшу повторюваність в Одесі мають вітри з півночі, найменшу — з південного сходу. Найбільша швидкість вітру спостерігається у січні-лютому, найменша у червні-липні. У січні вона в середньому становить 4,6 м/с, у липні — 3,2 м/с. Найбільше ясних днів спостерігається у серпні, найменше — у грудні. Упродовж року в Одесі спостерігаються різноманітні атмосферні явища: гроза, туман, роса, ожеледиця тощо. Зокрема, туман найчастіше спостерігається у січні-березні, гроза — у червні та липні.",
            "districts_description": "Місто поділяється на 4 райони: Приморський (історичний центр та схід), Київський (південь), Хаджибейський (захід) та Пересипський (північ).",
            "economics_description": "Основа економіки — транспортні перевезення, машинобудівна, хімічна, нафтопереробна, харчова та легка промисловості. У сфері послуг провідну роль (особливо в літні місяці) займає туризм.",
            "landmarks": [
                "Воронцовський маяк",
                "Потьомкінські сходи",
                "Пам'ятник Дюку",
                "Приморський бульвар",
                "Театр опери та балету",
                "Морський порт",
                "Ланжерон",
                "Одеський пасаж",
                "Міський сад"            
            ]
        }
    ]
}