import { Injectable } from '@angular/core';
import { CitiesCards } from './citiescards';

@Injectable({
  providedIn: 'root'
})
export class CitiesService {

  protected citiesCardsList: CitiesCards[] = [
    {
      "id": 0,
      "name": "Чернігів",
      "region": "Чернігівська область",
      "year": 907,
      "population": 280000.0,
      "oldnames": "-",
      "photos": ["../assets/chernihiv_2.jpg", "../assets/chernihiv_1.jpg", "../assets/chernihiv_3.jpg", "../assets/chernihiv_4.jpg"],
      "description": "Одне з провідних міст Київської Русі",
      "landmarks": [],
    },
    {
      "id": 1,
      "name": "Київ",
      "region": "Київська область",
      "year": 482,
      "population": 2000000.0,
      "oldnames": "-",
      "photos": ["../assets/kyiv_1.jpg", "../assets/kyiv_2.jpg", "../assets/kyiv_3.jpg", "../assets/kyiv_4.jpg"],
      "description": "Одне з провідних міст Київської Русі",
      "landmarks": [],
    },
    {
      "id": 2,
      "name": "Харків",
      "region": "Харківська область",
      "year": 1654,
      "population": 1300000.0,
      "oldnames": "-",
      "photos": ["../assets/kharkiv_1.jpg", "../assets/kharkiv_2.jpg", "../assets/kharkiv_3.jpg", ""],
      "description": "Ха́рків — місто на північному сході України, на Слобожанщині, науковий центр України, адміністративний центр Харківської області. Друге за кількістю мешканців місто України з населенням 1 421 125 осіб на 01.01.2022. Площа міста — 350 кілометрів квадратних. Разом із прилеглими містами й районами утворює Харківську агломерацію з людністю понад 2 млн осіб. Територія Харкова поділена на 9 адміністративних районів. З 2020 року місто входить до складу Харківського району. Харків з 2022 року має відзнаку «Місто-герой України». Місто має Приз Європи (2010 рік). У 2012 році в Харкові проходили матчі Чемпіонату Європи з футболу. \n\nХарків розташований на схилах Середньоруської височини, в долинах річок Уди (ліва притока Сіверського Дінця), Лопань (ліва притока Уди) та Харків (ліва притока Лопань). Рельєф — яружно-балковий, з високими правими берегами річок. На території міста є штучні озера: водосховища та затоплені кар'єри. В заплавах річок трапляються стариці. \n\nКлімат Харкова — помірно-континентальний. Зима прохолодна та сніжна, з декількома відлигами; літо — спекотне, з короткочасними дощовими періодами; весна та осінь — короткі, з заморозками на ґрунті. Середня температура року становить +8,7 °C, середня річна кількість опадів — 520 мм. Харків розташовано в лісостеповій природній зоні. З рослинності домінують породи широколистяних лісів. Природно-заповідний фонд Харкова становлять 15 територій та об'єктів, серед яких 2 загальнодержавних (зоопарк і ботанічний сад ХНУ) Харків був заснований у 1654 році як фортеця для стримування набігів кримських татар і ногайців. Місто стає полковим центром Харківського слобідського козацького полку. З 1765 року, у наслідку скасування козачого устрою Слобожанщини, Харків став губернським містом. На початку ХХ століття місто було великим промисловим, культурним, торговим та освітніми Слобідської України в Російській імперії. Після Лютневої революції 1917 року Харковом керували представники різних влад: Українська соціал-демократична робітнича партія, Партія українських соціалістів-революціонерів (есери), більшовики, ЗСПУ та інші. З грудня 1919 року до Харкова повернувся радянський уряд і Харків став першою столицею УРСР (по січень 1934 року). Місто почало розвиватися у напрямку індустріалізації. Почали будуватися великі заводи, населення збільшувалось за рахунок міграції. Паралельно розвивається наука та культура. В Харкові вперше в СРСР було розщеплене атомне ядро",
      "landmarks": [],
    },
    {
      "id": 3,
      "name": "Житомир",
      "region": "Житомирська область",
      "year": 882,
      "population": 200000.0,
      "oldnames": "-",
      "photos": ["../assets/zhytomyr_1.jpg", "../assets/zhytomyr_2.jpg", "", ""],
      "description": "Місто, якого не існує",
      "landmarks": [],
    },
    {
      "id": 4,
      "name": "Львів",
      "region": "Львівська область",
      "year": 1100,
      "population": 700000.0,
      "oldnames": "-",
      "photos": ["../assets/lviv_1.jpg", "../assets/lviv_2.jpg", "../assets/lviv_3.jpg", "../assets/lviv_4.jpg"],
      "description": "Одне з найрозвинутіших міст Заходу України",
      "landmarks": [],
    },
    {
      "id": 5,
      "name": "Ужгород",
      "region": "Закарпатська область",
      "year": 1200,
      "population": 120000.0,
      "oldnames": "-",
      "photos": ["../assets/uzhgorod_1.jpg", "../assets/uzhgorod_2.jpg", "", ""],
      "description": "Одне з найрозвинутіших міст Заходу України",
      "landmarks": [],
    },
    {
      "id": 6,
      "name": "Одеса",
      "region": "Одеська область",
      "year": 1200,
      "population": 700000.0,
      "oldnames": "Хаджибей",
      "photos": ["../assets/odessa_1.jpg", "../assets/odessa_2.jpg", "../assets/odessa_3.jpg", ""],
      "description": "Одне з найрозвинутіших міст Півдня України",
      "landmarks": [],
    },
  ];

  constructor() { }

  getAllCities() : CitiesCards[] {
    return this.citiesCardsList;
  }

  getCityById(id: Number) : CitiesCards | undefined {
    return this.citiesCardsList.find(citiesCards => citiesCards.id === id);
  } 

}
