import { Injectable } from '@angular/core';
import { CitiesCards } from './citiescards';

@Injectable({
  providedIn: 'root'
})
export class CitiesService {

  protected citiesCardsList: CitiesCards[] = [
    {
      "id": 0,
      "name": "Чернігів",
      "region": "Чернігівська область",
      "year": 907,
      "population": 280000.0,
      "oldnames": "-",
      "photos": ["../assets/chernihiv_2.jpg", "../assets/chernihiv_1.jpg", "../assets/chernihiv_3.jpg", "../assets/chernihiv_4.jpg"],
      "description": "Одне з провідних міст Київської Русі",
      "landmarks": [],
    },
    {
      "id": 1,
      "name": "Київ",
      "region": "Київська область",
      "year": 482,
      "population": 2000000.0,
      "oldnames": "-",
      "photos": ["../assets/kyiv_1.jpg", "../assets/kyiv_2.jpg", "../assets/kyiv_3.jpg", "../assets/kyiv_4.jpg"],
      "description": "Одне з провідних міст Київської Русі",
      "landmarks": [],
    },
    {
      "id": 2,
      "name": "Харків",
      "region": "Харківська область",
      "year": 1654,
      "population": 1300000.0,
      "oldnames": "-",
      "photos": ["../assets/kharkiv_1.jpg", "../assets/kharkiv_2.jpg", "../assets/kharkiv_3.jpg", ""],
      "description": "Ха́рків — місто на північному сході України, на Слобожанщині, науковий центр України, адміністративний центр Харківської області. Перша столиця Радянської України (1919-1934 рр.) Друге за кількістю мешканців місто України з населенням 1 421 125 осіб на 01.01.2022. Площа міста — 350 кілометрів квадратних. Разом із прилеглими містами й районами утворює Харківську агломерацію з людністю понад 2 млн осіб. Територія Харківської міської територіальної громади поділяється на дев'ять адміністративно-територіальних одиниць — районів: Шевченківський, Новобаварський, Київський, Слобідський, Холодногірський, Салтівський, Індустріальний, Немишлянський і Основ'янський. Найбільшим за площею є Київський район, а найменшим — Немишлянський. З 2020 року місто входить до складу Харківського району.\n\nХарків розташований на схилах Середньоруської височини, в долинах річок Уди (ліва притока Сіверського Дінця), Лопань (ліва притока Уди) та Харків (ліва притока Лопань). Рельєф — яружно-балковий, з високими правими берегами річок. На території міста є штучні озера: водосховища та затоплені кар'єри. В заплавах річок трапляються стариці. Клімат Харкова — помірно-континентальний. Зима прохолодна та сніжна, з декількома відлигами; літо — спекотне, з короткочасними дощовими періодами; весна та осінь — короткі, з заморозками на ґрунті. Середня температура року становить +8,7 °C, середня річна кількість опадів — 520 мм. Харків розташовано в лісостеповій природній зоні. З рослинності домінують породи широколистяних лісів. Природно-заповідний фонд Харкова становлять 15 територій та об'єктів, серед яких 2 загальнодержавних (зоопарк і ботанічний сад ХНУ).\n\nХарків був заснований у 1654 році як фортеця для стримування набігів кримських татар і ногайців. Місто стає полковим центром Харківського слобідського козацького полку. З 1765 року, у наслідку скасування козачого устрою Слобожанщини, Харків став губернським містом. На початку ХХ століття місто було великим промисловим, культурним, торговим та освітніми Слобідської України в Російській імперії. Після Лютневої революції 1917 року Харковом керували представники різних влад: Українська соціал-демократична робітнича партія, Партія українських соціалістів-революціонерів (есери), більшовики, ЗСПУ та інші. З грудня 1919 року до Харкова повернувся радянський уряд і Харків став першою столицею УРСР (по січень 1934 року). Місто почало розвиватися у напрямку індустріалізації. Почали будуватися великі заводи, населення збільшувалось за рахунок міграції. Паралельно розвивається наука та культура. В Харкові вперше в СРСР було розщеплене атомне ядро.\n\nПід час Другої світової війни німецька армія вступила до Харкова у жовтні 1941 року. За часи двохрічної окупації населення міста зменшилось більше ніж у 3 рази. За оцінками експертів Харків був одним із найбільш зруйнованих міст Другої світової війни в Європі\n\nЗа часи радянської влади місто було великим промисловим, науковим, освітнім, транспортним центром України та СРСР. Харків в ті часи був відомий своїми заводами: ХТЗ (Харківський тракторний завод), Турбоатом та заводом ім. Малишева, будівлею Держпрому, найбільшою площею Європи (зараз площа Свободи), зоологічним парком, Харківським національним університетом та іншими. Значну роль в економіці СРСР Харків відіграв у авіаційному, тракторному та військовому машинобудуванні й електроніці. Через Харків проходили транспортні шляхи, які з'єднували центр імперії з півднем, захід з центром. У 1975 році у Харкові було відкрито першу лінію метрополітену.\n\nЗ початку Незалежності України Харків, як й вся країна, опинився у ситуації перебудови економіки. Багато підприємств було закрито або реконструйовано, через зв'язки з ринками країн СНД та залежність від російської нафти, мінералів і газу.\n\nЗ 2006 року місцева рада системно орієнтувала економіку, культуру та інші сфери життя містян на співробітництво з РФ. Протести Євромайдану взимку 2013—2014 років в Харкові були не численні. У березні та квітні 2014 року сили безпеки та контрдемонстранти завадили сепаратистським намірам створення в Харківській області автономії за сценарієм Донбасу. Опитування, які були проведені з вересня по грудень 2014 року, виявили в Харкові незначну кількість містян, які підтримували приєднання до Росії.\n\nЕкономіка Харкова після припинення співробітництва з РФ почала переорієнтовуватися на нові міжнародні ринки, військові підприємства мали збільшення оборонних контрактів, продовжував розвиватися експорт в секторі ІТ-послуг.\n\nОстанній перепис населення 2001 року показав, що в місті мешкало 62,8 % українців. Українська мова є єдиною офіційною мовою міста. За даними опитування, проведеного Міжнародним республіканським інститутом у 2023 року більшість населення міста вдома спілкуються російською мовою.\n\nХарків має розвинуту мережу міського громадського транспорту: тролейбусні, трамвайні, автобусні маршрути та метрополітен (3 гілки з 30 станціями).\n\nПід час російського вторгнення в Україну у 2022 році Харків був місцем запеклих боїв між українськими та російськими військами. У травні 2022 року українські війська відкинути російські війська від міста. Російська артилерія та ракети залишились в радіусі міста, і воно продовжувало систематично зазнавати обстрілів і ракетних ударів. Після Слобожанський контрнаступ у вересні 2022 року, місто  залишається під періодичним обстрілом Росії здебільшого ракетами з комплексу С-300.На квітень 2024 року майже чверть міста була знищена, особливо постраждали його північні райони.\n\nЯк культурний та освітній центр Слобожанщини та України, Харків до 24.02.2022 мав 60 науково-дослідних інститутів, 45 вищих навчальних закладів, серед яких ХНУ імені В. Н. Каразіна, який входить до найкращих 500 ВНЗ світу та НТУ «ХПІ», який входить до найкращих 1000, 8 музеїв, міську картинну галерею, 7 державних театрів і кілька десятків недержавних, 80 бібліотек, спортивні об'єкти, виставкові зали та сучасні офісні простори.\n\n16 листопада 1924 року о 19:00 в Харкові вийшла в ефір перша вітчизняна радіопередача. З гучномовців пролунало: «Алло, алло, алло! Говорить Харків, говорить Харків, говорить Харків!». На честь початку мовлення Українського радіо 1994 року 16 листопада в Україні проголошено Днем працівників радіо, телебачення та зв'язку.",
      "landmarks": [],
    },
    {
      "id": 3,
      "name": "Житомир",
      "region": "Житомирська область",
      "year": 882,
      "population": 200000.0,
      "oldnames": "-",
      "photos": ["../assets/zhytomyr_1.jpg", "../assets/zhytomyr_2.jpg", "", ""],
      "description": "Місто, якого не існує",
      "landmarks": [],
    },
    {
      "id": 4,
      "name": "Львів",
      "region": "Львівська область",
      "year": 1256,
      "population": 717273.0,
      "oldnames": "-",
      "photos": ["../assets/lviv_2.jpg", "../assets/lviv_1.jpg", "../assets/lviv_3.jpg", "../assets/lviv_4.jpg"],
      "description": "Львів — місто в Україні, адміністративний центр області, агломерації, району, міської громади, національно-культурний та освітньо-науковий осередок країни, великий промисловий центр і транспортний вузол. Вважається столицею Галичини та центром Західної України. За кількістю населення — п'яте місто країни (717 273 станом на 01.01.2022).\n\nЛьвів заснував король Данило приблизно у 1231—1235 роках (перша згадка від 1256 року). Близько 1272 року місто стало столицею Королівства Русі (Галицько-Волинського князівства). Невдовзі після смерті князя Юрія II Львів на понад чотири століття опинився під владою Королівства Польського. 1356 року місто отримало маґдебурзьке право; в добу Середньовіччя Львів був важливим торговельним центром. За австрійського панування місто стало осередком українського та польського національного рухів. Після розпаду Австро-Угорщини восени 1918 року Львів деякий час був столицею Західноукраїнської Народної Республіки, але після українсько-польської битви за місто в листопаді 1918 перейшов до Польщі, що в 1922—1923 було визнано міжнародними пактами та угодами. Під час Другої світової війни місто захопив Радянський Союз, а згодом — Німеччина. Після війни було юридично закріплено ялтинську угоду 1945, за якою Східна Галичина і зокрема Львів лишався у складі Української РСР. 1946 року між Польщею та УРСР відбувся обмін населення, який разом із наслідками війни суттєво вплинув на населення Львова. З 1991 року Львів перебуває у складі України.\n\nІсторичний центр Львова занесено до списку Світової спадщини ЮНЕСКО. У місті розташована найбільша кількість пам'яток архітектури в Україні. 2009 року Львову надано звання Культурної столиці України\n\n. Місто періодично посідає чільні місця в рейтингах туристичної та інвестиційної привабливості.\n\nЛьвівський клімат є помірно континентальним з м'якою зимою і теплим літом. Середньомісячна температура повітря становить −3 °C у січні і +19 °C у липні. Абсолютний максимум температури повітря (+37,0 °C) зафіксований у серпні 1921 року, абсолютний мінімум — (−33,6 °C) 10 лютого 1929 року; максимальна кількість опадів (1 422 мм) випала 1893 року. Загалом за останні 100—120 років температура повітря у Львові має тенденцію до підвищення. За цей період середньорічна температура підвищилася принаймні на 1 °C[15]. Вологість повітря в середньому за рік становить 79 %. Найчастіше дмуть західні вітри, найрідше — північно-східні.\n\nЛьвів характеризується найбільшою кількістю опадів і найнижчими літніми температурами серед усіх обласних центрів України, що спричинено чи не найменшою континентальністю місцевого клімату з-поміж великих міст України. У середньому за рік випадає 767 мм атмосферних опадів: найменше — в січні, найбільше — в липні. За рік у місті в середньому 174 дні з опадами. Через це місто часто називають «приреченим на дощ». Тема львівського дощу є популярною в місцевих художників, поетів і музикантів. Середня висота снігового покриву становить 7.8 см\n\nДля всіх пір року характерні різкі перепади атмосферного тиску, температур і вологості повітря. Зими м'які — морози нижче −20 °C спостерігаються вкрай рідко. Стійкий сніжний покрив встановлюється не кожної зими. Весна прохолодна та дощова, заморозки і снігопади можливі до початку травня. Літо прохолодне. Звичайні літні полуденні температури в межах +20-25 °C, спека вище +30 °C спостерігається рідко. Влітку частими є грозові зливи і різкі перепади температур при проходженні атмосферних фронтів. При цьому майже щороку спостерігаються ураганні вітри, які призводять до повалення дерев, обриву ліній електропередач, невеликих руйнувань. Так, 2008 року, внаслідок буревію загинуло 4 людей. Осінь помірно тепла і суха. Тривалість вегетаційного періоду — 215 днів.\n\nМікроклімат центральної частини міста, яка розташована в улоговині, характеризується нижчими мінімальними та вищими максимальними температурами. Для підвищених околиць характерні сильні вітри.\n\nАдміністративно Львів поділяється на 6 районів: центральна частина належить до Галицького району, західна — до Залізничного, північна — до Шевченківського, східна — до Личаківського, південно-східна — до Сихівського, а південна — до Франківського. Разом з цим, у вжитку збереглися давні назви частин міста та сільських місцевостей, які увійшли з часом до складу міста, як-то Левандівка, Білогорща, Збоїща, Рясне, Майорівка, Вулька, Новий Львів, Снопків, Боднарівка, Пирогівка, Козельники, Сихів та інші. Деякі з них відображені сьогодні у назвах вулиць.\n\nУ підпорядкуванні Львівської міської ради також перебувають місто Винники і селища міського типу Брюховичі та Рудне.",
      "landmarks": [],
    },
    {
      "id": 5,
      "name": "Ужгород",
      "region": "Закарпатська область",
      "year": 1200,
      "population": 120000.0,
      "oldnames": "-",
      "photos": ["../assets/uzhgorod_1.jpg", "../assets/uzhgorod_2.jpg", "", ""],
      "description": "Одне з найрозвинутіших міст Заходу України",
      "landmarks": [],
    },
    {
      "id": 6,
      "name": "Одеса",
      "region": "Одеська область",
      "year": 1200,
      "population": 700000.0,
      "oldnames": "Хаджибей",
      "photos": ["../assets/odessa_1.jpg", "../assets/odessa_2.jpg", "../assets/odessa_3.jpg", ""],
      "description": "Одне з найрозвинутіших міст Півдня України",
      "landmarks": [],
    },
  ];

  constructor() { }

  getAllCities() : CitiesCards[] {
    return this.citiesCardsList;
  }

  getCityById(id: Number) : CitiesCards | undefined {
    return this.citiesCardsList.find(citiesCards => citiesCards.id === id);
  } 

}
